[
  {
    "zone": "The Anduin Vale",
    "quest_name": "Aiding Offa",
    "target_player": "Any, besides elves",
    "repeatable": true,
    "location": "Eastern Lorien",
    "objective": "Aid Offa by slaying an Elf that hunts him",
    "description": "As I was exploring the lands that lie east of Lórien and west of the great river Anduin, I was approached by a dark-skinned man. \nHe moved stealthily in the wilderness. He claimed he was trailed by an elven scout of Lórien. He last saw the tall, wiry elf \nscouting along the banks of Anduin to the south.\n\nIt was apparent during our meeting that we both sought to serve the will of the Dark Lord. The offer of a reward on part of him \nwas enough to sway me into assisting him in the slaying of the elf. He asked that I bring him the elf's cloak as evidence of its \ndemise.\n\nI brought the elf's blood-covered cloak to Offa who cackled and was clearly very pleased. He gave me with some poison ingredients \nas a reward stating that I would surely find a way to use them.",
    "walkthrough": "Quest loads if Offa starts talking to you after you approach him. He claims that he's trailed by an elven scout from Lorien and \nasks you to bring him the elf's cloak as evidence of the scout's demise. Find Coubhel the elven wanderer, usually he sneaks around \nsomewhere east of the Lorien borders. Kill him and bring the cloak back to Offa for the reward.",
    "reward": "a small fluid-sack, a grey fluid-sack",
    "achievement": "You assisted Offa the scout in dispatching the Lórien elf who was stalking him."
  },
  {
    "zone": "The Anduin Vale",
    "quest_name": "Azra-Zaira's library",
    "target_player": "BN",
    "repeatable": true,
    "location": "the Anduin Vale, Underground Chamber",
    "objective": "Contribute the palantir of Amon-Sul to the library",
    "description": "During my travels I found a secluded library under a blackhatch on within the Gladden Fields. I was greeted by Azra-Zaira, who \nwished to preserve anything that held regards to Numenor. She requested that I retrieve the lost Seeing Stone of Amon-Sul and \nreturn it to her so that it would benefit all who may bend it to their will.\n\nI contributed the Seeing Stone of Amon-Sul to the library of Azra-Zaira and received a star charm in return.",
    "walkthrough": "Forostar north. Orrostar east. Hyarrostar southeast. Hyarnustar southwest. Andustar west. Mittalmar center. 'Look star' in the \nroom reveals a map with the texts: N E SE SW W C in the directions nort, east, southeast, southwest, west and center. You have \nto push the stake with the right region to the right spot. So for instance if N is in the southeast you have to push Forostar to \nthe southeast. You need a palantir from the Death Knight to get the reward.",
    "reward": "star charm",
    "achievement": "You contributed the Seeing Stone of Amon-Sul to the library of Azra-Zaira."
  },
  {
    "zone": "The Anduin Vale",
    "quest_name": "Buttercup is missing",
    "target_player": "Whitie, BN",
    "repeatable": true,
    "location": "Farmed Fields (south-east from Ingrove)",
    "objective": "Find Buttercup, Farmer Ocher's favourite cow",
    "description": "As I was travelling through the fertile lands of the Anduin Vale I met with a distraught farmer. His favourite cow, Buttercup, \nhas wandered off and he thinks that she may have gone in the direction of the evil forest to the east. I'll keep an eye out for \na brown and white cow with a cowbell.\n\nI found the cow. She was scared for her life after having been cornered by giant spiders. She's home now at last and Farmer Ocher \nwas very happy to see her again. In return, Farmer Ocher gave me some items that had been left by a brave traveller who died \nfighting against trolls many years ago. I hope I can put them to good use against the trolls soon.",
    "walkthrough": "Farmer Orcher will ask you to find his cow Buttercup who left to the Mirkwood direction. Buttercup can be found some east area \nwith spiders or inside Mirkwood (go in from the gate) with the spider. Kill the spider and 'lead cow' back to the farmer. Bears \ncant lead Buttercup, return to human form to do it.",
    "reward": "curdled milk, wooden pipe, forest green cloak or yew longbow, 250 xp",
    "achievement": "You recovered Buttercup, the favourite cow of Beorning farmer Ocher."
  },
  {
    "zone": "The Anduin Vale",
    "quest_name": "Coubhel's inquiry",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Eastern Lorien",
    "objective": "Help Coubhel find evidence of the man's loyalties",
    "description": "I found a tall, wiry elf in the lands east of Lórien and west of the great river Anduin named Coubhel. This elf helped protect \nthe borders of the Golden Wood from evil and lamented that it was so difficult to tell a friend from a foe when it came to men.\n\nHe had been trailing a mystery scout and was unable to learn more. He said that the man tended to stay nearby in the north; \navoiding the forest and staying close to the river. He requested an insignia to help find out something about this man's loyalties.\n\nI returned to Coubhel with an enamelled cloakpin which caused the elf to brighten up and make a comment that he was suspicious \nfor no reason. This mystery man was a friend of the Wise, and I was rewarded with a gift for my efforts.",
    "walkthrough": "Coubhel wanders in the area past the eastern Lorien bridges (he sneaks), or he is at his Flet (5e n 3e u from Slender Bridge. \nCoubhel the elven wanderer will give you an idea, depending on his response when you ask him \"lute\", whether or not you can \ncomplete the quest. The quest doesn't load always. If it doesn't load, he will tell you where he hid his boat or give you bless. \nIf the quest loads, he will ask you to bring an insignia from a mystery man.. Find Offa the scout (who will also try to get you \nto kill Coubhel if you are not an elf, beware though, while you will get rewarded, this is an evil act). Kill Offa and bring the \nenamelled cloakpin back to Coubhel. To repeat this quest you don't need to trigger it again, just hand over the cloakpin.",
    "reward": "5 gold, lembas wafer, gingsen root (~25% chance)",
    "achievement": "You helped the Coubhel solve the mystery of the man sneaking around Lorien's borders."
  },
  {
    "zone": "The Anduin Vale",
    "quest_name": "The Elven dagger",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "the Anduin Vale, A Restored Hobbit Hole",
    "objective": "An Elven scout tells a tale of a lost dagger",
    "description": "Somewhat south and west of the town of Ingrove, near the great river Anduin, I came upon a cleverly camouflaged wooden door. Upon\nknocking on it, I was welcomed by an elven scout from Rivendell. I noticed his weapon; it was unlike any I had seen on any of the\nelves from the fair halls of Imladris. Curious, I asked him about it, and he shared with me the reason for the rarity of said weapon.\nHe mentioned having lost a dagger like his own in a fight with one of Sauron's minions after throwing it in a failed attempt to \nslay it as it managed to run away. Given the rarity of the weapon, I thought of searching for it and returning it to its owner.\n\nSouth of the hills where I found the elven scout I found myself in small, yet dark, forest infested with trolls. Evidence suggested\nthat the goblin had either died or managed to rid himself of the dagger. After braving the dangersof the forest I found the scout's \ndagger. I returned it to him and he rewarded me generously for my troubles.",
    "walkthrough": "An elven scout loads south of Ingrove,  and it's behind a hidden woodendoor. Knock this door to open it. The elf is missing one \nof his elven daggers. The dagger he is missing loads in the forest with trolls and a goblin corpse just south of him, either hidden \nin one of the rooms or in the corpse.",
    "reward": "5 gold, a flask of miruvor (rare).",
    "achievement": "You retrieved the dagger lost by one of Elrond's scouts in a goblin attack near the Anduin."
  },
  {
    "zone": "The Anduin Vale",
    "quest_name": "Enidale's ring",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Eastern Lorien",
    "objective": "Help Enidale recover the lost ring of his people",
    "description": "In the heart of the Anduin Vale, I stumbled upon the ghostly figure of Enidale. This spectral being lingered mournfully at the \ntomb by day, only to emerge at nightfall, drifting aimlessly. Enidale's ethereal essence carried a profound yearning for its lost \nancestral ring, taken by a dark-skinned thief.\n\nHaving returned Enidale's cherished ring, a sense of tranquility descended upon the spirit. I was bestowed with a reward as a \ntoken of Enidale's appreciation. With a reverent gaze, the ghost dissipated into the ethereal realms, finding solace in the \nrestoration of its long-lost possession.",
    "walkthrough": "First you need to find Offa the scout. Kill him and loot the key from his pouch. Open deadplants, go down, kill the spiders and\nloot the chest (it loads some rings which can be sold).The golden quartzite ring is Enidale's ring. You can keep the ring, which\nacts as a bless ring when used or give it to Enidale's ghost, he appears and night around the ruined barn some e and n from the \norkish rider camp across Anduin river. He will reward you with a black metal wristband which converts some offensive bonus into \ndefense when you are on wimpy mode.",
    "reward": "Little over 2 gold in coins and rings, golden quartzite ring OR black metal wristband",
    "achievement": "You returned to the ghost of Enidale the ring of his people."
  },
  {
    "zone": "The Anduin Vale",
    "quest_name": "Freśf's task",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "the Anduin Vale, Freśf's Bakery",
    "objective": "Aid Freśf and be allowed the use of his oven",
    "description": "Hidden behind some thick stems close to an area of extensive grasses I found the corpse of a large red deer. I proceeded to get\nthe antlers and headed to Honburg to get the baker to burn them down. When I arrived he looked in disgust at them and refused \nto help me. However he finally agreed to help if I would do a service for him: convince the beekeeper from a nearby village to \nsend him some of his best honey, in order to make the famous Honburg honey-cakes. I agreed to this and went south.\n\nGetting the beekeeper to give me honey for Freśf was no small task, he seemed amused at the request, but agreed to help me if I \ncould rid him of some particularly obnoxious bees and bring him the corpse of their queen as proof. This I did  promptly and he \nfulfilled his end of the bargain sending honey to the baker.\n\nAs I entered Freśf's bakery, he recognized my achievement and proceeded, making use of his amazing strength, to break down the \nantlers and set them in a far corner of his oven to minimize their long term effect. Once he was done he gave me the dark powder \nthat resulted from the charring of the antlers.",
    "walkthrough": "Go from outside of Beorn's home: s 2e n e s open thickstems w - there loads a deer corpse with antlers in it. With antlers in \ninventory approach the baker in Honburg - he asks you for honey from the beekeeper, go to him and 'ask beekeeper honey'. He asks \nyou to kill the queen bee, it lives nearby. Kill it and bring its corpse to the beekeeper. Now he says he sends some honey to the \nbaker. Return to the baker, listen to him, and then give him the antlers. Now you can take the blackened burned powder to the Hag.",
    "reward": "3000 xp, blackened burned powder",
    "achievement": "You secured honey for Freśf, who then burned the deer antlers and gave you the dark powder."
  },
  {
    "zone": "The Anduin Vale",
    "quest_name": "The hag's errand",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Ingrove, Hag's House",
    "objective": "Bring the hag in Ingrove a powder from burnt antlers",
    "description": "I reached a dead end street in Ingrove and found myself inside a store filled with intriguing smells. As I entered, an old woman, \nobviously the owner, set her eye upon me and started sharing her experience with potions. She seemed to take some interest in me \nand asked for my assistance in getting her some apparently rare ingredient to get. At least for her it is hard to get since it is \nobtained by burning the antlers of one of the red deer that inhabit the valley - and the owner of the only oven capable of doing \nit, a baker from the Honburg village, seems to not have much love for such a process.\n\nI returned back to the Old Hag in Ingrove with the black powder Freśf gave me. She smiled in a conniving way as she took the black \npowder and thought of a proper reward for me. She seemed to make up her mind and, as she started mixing ingredients, rambled some \nmore about potions. She finished the concoction by adding some of the powder I had collected for her. She proceeded to smile in \nan impish manner as she explained the properties of the potion she had just made. She poured it into a water skin so as to allow \nme to give it to someone without arousing suspicion. I wonder what exactly it will do ...",
    "walkthrough": "Old Hag (herbalist shop) asks every newbie around to bring her the powder of black antlers. Solve quest 'Freuf's task' to get \nthe powder. When you have it bring the blackened burned powder to the Hag and receive a skin with a 'love potion'.",
    "reward": "3000 xp and love potion (water skin).",
    "achievement": "You have brought black powder to the Old Hag of Ingrove, and for whatever reason received a love potion as the payment."
  },
  {
    "zone": "The Anduin Vale",
    "quest_name": "Lost children",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Watery Pit (sw corner of Anduin Vale zone); needed 30 str to open door down",
    "objective": "Two children are missing in the Anduin vale",
    "description": "The lands west of the Old Ford on the Anduin River have suffered lately from raids by the Orcs from the Misty mountains. I was \nwandering around the area when I encountered a old man. He was overwhelmed by grief and seemed to wander aimlessly as if looking \nfor something. He shared this the plight, his grandchildren, who had been in his keeping since their parents died, had gone to \nvisit friends in a village nearby. Unfortunately, Orcs stormed the village. Ever since he had not heard from them yet he claimed \nhe could feel their presence and asked me to go to the ruins, where he dared not enter.\n\nAs I prepared to head that way, I saw him shift his pose to that expected from a seasoned warrior, holding an imaginary sword. \nHe said he would meet me further down in the valley when we had driven out the attackers.  Was he delusional? Did these children \nreally exist or were they another figment of his imagination. The answers to these questions I do not know, but in the remote \nchance that he is right and the children are alive and held by the Orcs then I must do my utmost to rescue them.\n\nThe village the farmer described had been ravaged by the servants of the Enemy. It was clear that some evil was at work there. \nA mansion that once stood proud in the village was scorched by flames. Inside was the foul sorcerer Nagash, protected by fearsome \nbears in a raging fury.\n\nOnce the beasts were dealt with and the sorcerer finally lay vanquished on the floor I found the children, Nellian and Nathein \ninside a dismal chamber. They seemed to be hoping for rescue as they asked me if I had come for them. Once I acknowledged this \nto them they followed me out of that dreadful place and I took them to their grandfather. He was ever so grateful and asked me \nto accompany him to his home. There he dug out a small token of his appreciation, a sword-shaped brooch, no doubt a memory from \nhis younger years. As I watched them disappear in the distance I set my mind back to my affairs.",
    "walkthrough": "This is the same location as the quest 'Nagash's research' for darkies. Kill Nagash and get the twins from his locked room. They \nwill follow you as soon as you acknowledge that you are there to save them.  Take them to their father, the sad farmer. He wanders\nin a zone west of Vale ford. He will take you to his cottage and give you his reward.",
    "reward": "10k xp, sword shaped cloakpin",
    "achievement": "You rescued the twins of an Anduin Vale farmer from the Numenorean sorcerer Nagash."
  },
  {
    "zone": "The Anduin Vale",
    "quest_name": "Nagash's research",
    "target_player": "Torc/Morc",
    "repeatable": true,
    "location": "",
    "objective": "Fetch the goblet from the ancient chieftain's tomb",
    "description": "I found Nagash in a circular chamber where he requested help. In order to complete his research, he needed a suitable container \nthat was buried within the nearby tomb of an ancient chieftain. He said that timing was crucial and that I should return quickly\nwith a small silver goblet. He also mentioned that the tomb would have spirits and that I should defile the mural in the chamber.\n\nI gave the goblet to Naghash and he started a ceremony. He pulled two children from a pit, tied them to an altar, and sacrificed \nthem. He poured their blood into the goblet, drank from it, and fell to the ground only to disappear with a bright flash. I found \nthe goblet in my hands and heard his fading voice echoing in my head 'Use the blood well!'",
    "walkthrough": "Nagash will ask you to bring him a silver goblet. It loads on the spectre in a tomb in the ne corner of the Vale. Spectre calls \nup to 4 undeads to help him if attacked, so beware. It's pointless to kill soldiers before the spectre: it will just summon new \nones. After it dies, the empty goblet falls to the ground - bring it to Nagash. He will sacrifice the twins and fill the goblet \nwith blood.",
    "reward": "Goblet of blood (if quaffed affects you by Blood of Sauron (+2 STR))",
    "achievement": "You brought a sacrificial goblet to the Numenorean sorcerer Nagash."
  },
  {
    "zone": "The Anduin Vale",
    "quest_name": "Narv's stolen ring",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "n of the Anduin Vale, Inside a House",
    "objective": "Avenge the murder of Narv's wife and return a ring",
    "description": "I was travelling close to the Great Forest of Mirkwood, many miles north of the village of Ingrove when I noticed, among the grassy\nplains, a small house. I entered cautiously and was greeted by an old beorning. He shared with me his sad story; how a cloaked \nstranger had come one evening and broken into his home. How he had found his wife lifeless on the floor and some of their few\nvaluables taken. In his grief he recalled the one thing that was most important to him: her ring. He asked me to avenge the death \nof his wife and, if possible, recover this item. He suggested I look for Beol, a beorning experienced in woodcrafts and survival \nin the wilderness.\n\nFollowing old Narv's suggestion I sought out and eventually found Beol the Ranger, he recalled having seen the stranger Narv had \ndescribed to him yet he acknowledged how elusive he was. He gave me advice as to the general direction where the cloaked stranger \nhad been last seen.\n\nBeol's advice took me to the assassin. He put up quite a fight yet when he saw himself all but lost, sought to escape. After some \nchasing I finally managed to vanquish him. From the corpse I took the ring, a beautiful azure ring. I took the ring back to Narv \nwho was extremely excited about it. While I expected no reward for my deed he insisted in giving me one.",
    "walkthrough": "Find Narv who lives in a three-room house some west from Mirkwood. Listen to him and accept his quest - find the assassin who \nkilled his wife, revenge for her death and return her ring to Narv. Vairr the Assassin pops in a zone n from Narv, but he can \nwander anywhere in Vale. Locate him if you are a mage, or spend some time tracking otherwise. Vairr is aggressive and can backstab \nyou, so beware. On low hps (low wounded) he starts running and hiding. Kill him and bring the azure ring to Narv - he gives you \na jade amulet or letter \nfor Ingrove citizenship (til lev20).",
    "reward": "Ingrove citizenship or jade amulet",
    "achievement": "You avenged the death of Narv the Beorning's wife and returned to him her ring."
  },
  {
    "zone": "The Anduin Vale",
    "quest_name": "Niuldor and a fever",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "",
    "objective": "Niuldor needs help finding a cure for a fever",
    "description": "As I travelled across the Anduin Vale, between the town of Ingrove and the forests of Lórien, I happen to run into a cleverly \nhidden refuge. I entered cautiously and found myself greeted by an grey-eyed Elf. He shared his concern over a dreadful fever that\nhad been afflicting the children. He had lived for many years far from Caras Galadhon and, in order to work on a cure, required \nan ancient parchment from the library of the Elven city. He asked for my assistance and I agreed to aid him if I could. \n\nUndaunted, I set forth to get the berries for Niuldor. Eventually I found an elderberry plant with berries in it. I took them back \nto Niuldor who was so grateful he offered to add something to my herbal kit to aid me in brewing potions.",
    "walkthrough": "Niuldor the Herbalist will ask you to retrieve a parchment from the librarian in Lorien. Go to 'The Great Library' (s, 2u, w) from\nThe Shimmering Fountain) and 'ask librarian parchment'. After bringing him the parchment, he will ask you to retrieve elderberries \nfrom Fangorn.",
    "reward": "herbal kit upgrade",
    "achievement": "You helped Niuldor the botanist to prepare a cure disease potion."
  },
  {
    "zone": "The Anduin Vale",
    "quest_name": "Old hobbit mill",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "the Anduin Vale, Freśf's Bakery",
    "objective": "Freśf wants the old Honburg hobbit mill fixed",
    "description": "I found Freśf the baker sighing and muttering something about hobbits and a mill in the small village of Honburg within the Anduin\nVale. I asked him about that and he explained that the old hobbit mill on the hillside of the village was broken. He asked if I \ncould get it in working condition such that he wouldn't have to waste time working a hand mill.\n\nI managed to repair the mill by getting some help. The pool and channel were cleaned using a shovel to allow the water flow against\nthe waterwheel. The cogwheel was repaired and inserted back into the revolving mechanism. The shaft and grindstone were loosened \nby greasing, pushing, and turning the whole rotating mechanism at the same time. It was at this point that the mill started working \nagain under its own power and Freśf the baker was overjoyed to never have to hand mill again.",
    "walkthrough": "Go to Freśf, the baker, in Honburg (just west of the mill). Ask him about 'hobbit'. He will tell you that the mill east of Honburg\nhas been broken for some time, and that he wants it fixed. Go to the mill and go nw about three rooms to soakedfeet. Pick the door\ndown and go down all e. East of you is a hidden exit 'backwall', pick this open and go east and pick up the broken cogwheel. Rattlesnake \nin this room too so be careful if you are lowlev. Now you need to get this cog mended. In the room ws of the cog is a note from Rob\nSandyman saying his family are leaving the mill and going west, so follow in his footsteps and go visit his brother Ted who runs the\nmill in the Shire. (Ted's mill is just north of Three-Farthings Stone). When you enter Ted will look at the cog and offer to mend it. \nGive him the cog and then leave the room. Return and Ted will ignore you and pretend he never offered to help you. 'ask ted cogwheel'\nand he'll demand you go and pay his bar bill at the Green Dragon inn. Go wsesesw and enter the Green Dragon. 'ask bartender pay bill' \nand he will take 5 gold from you. Return to Ted and he'll grudgingly give you the mended cog. Now run all the way back to the mill.\n  In the wheel room (1 down in the mill) 'insert cog mechanism'. Now you see that the shaft turns a bit but the waterflow to the water\nwheel is blocked. Run to Ingrove, get a shovel from the armoury and get a flask of oil while you are there. Return to the mill and go\nto the wheel room. Wield the shovel and \"clean waterway\". Now the channel is clear but still no water is flowing so go to the source \nof the problem, the calm reservoir 1w 1n of the mill. Here it looks like the boulders are the problem but they are just a red herring,\n'exa pool' and you will see a load of gravel is blocking the flow. 'dig gravel' and you will clear it out. Now return to the mill and \nyou will see the water wheel is turning but still the shaft is stuck. 'exa shaft' and you see that it's rusty and jammed. To fix it \nyou need three people. Person one has to stand in the top room and when ready 'push grindstone'. Person two goes to the wheel room and\ndoes 'turn shaft'. Both of these commands must be done roughly the same time so I suggest that person three stands in the top room and \nyells 3, 2, 1, go. When both 1 and 2 are pushing/turning the rust will begin to flake off the shaft. While they are still pushing and \nturning person three must 'pour oil hole' this will grease the shaft and the grindstone will turn freely now. Go back to Freuf the \nbaker, he will thank you for repairing the mill and give you a letter for Loryen in Ingrove (til lev15).",
    "reward": "Ingrove citizenship",
    "achievement": "You fixed the old hobbit mill on the hillside near Honburg."
  },
  {
    "zone": "The Anduin Vale",
    "quest_name": "Sceptre of Kings",
    "target_player": "BN warlord",
    "repeatable": true,
    "location": "the Anduin Vale, Underground Chamber",
    "objective": "Serve the ebon wraith and obtain the Sceptre of Numenor",
    "description": "In the foreboding shadows of the northern Anduin Vale, an ancient and malevolent presence, known as the ebon wraith, bides its \ntime within Mirkwood forest. This dark harbinger holds the key to a powerful relic -- the Sceptre of Numenor. On the command of \nAzra-Zaira, I must seek out the ebon wraith, confront it, and fulfill its sinister commands to claim this relic of immense power.\n\nThe wraith, an extension of the Dark Lord's will, has decreed that Beorn must fall, and his deep black orb be brought forth. I \nhave confronted the ebon wraith, and emerged victorious. With the Sceptre of Numenor now in my grasp, I wield a symbol of unmatched \npower and ancient glory. Yet, I must ever be mindful that this power is not freely given; it is a chain, a covenant of blood and \nshadow, binding me inexorably to the will of the Dark Lord. Thus, I am forever entwined with the malevolent forces I now serve.",
    "walkthrough": "Visit Azra-Zaira south of Anduid Vale. When she asks 'Do you seek power, knowledge, or perhaps remembrance against sorrow?' say \n'sceptre'. Continue listening, and when she asks, 'Will you seek out the wraith once more?' say 'yes'. If you don't already have \ndeep black orb from Beorn, get it. If you have orb, head Mirkwood, north Anduin Vale. Search for hidden exit that will lead you \nto ebony wraith. Enter room and when wraith asks 'Why have you disturbed me?' say 'sceptre'. Continue listening, and when he asks, \n'Power is offered, and the price is presented. Do you accept, mortal?' say 'yes'. Hand over orb after he ask you to bring it.",
    "reward": "black runed sceptre, 5300 xp",
    "achievement": "You forged a dark pact with the ebon wraith and obtained the Sceptre of Numenor."
  },
  {
    "zone": "The Anduin Vale",
    "quest_name": "Spear of Bearog",
    "target_player": "Whitie, Torc/Morc",
    "repeatable": true,
    "location": "",
    "objective": "Find the pieces and reforge the spear",
    "description": "In my travels, I heard tales of a mighty relic of old-- the Spear of Bearog the Beorning himself. A weapon of wonder, its shaft \nwas black as the darkest night, forged from pure metal, and its glittering spearhead was nearly the size of a grown man's hand. \nIf I could gather all its pieces, perhaps, with the help of a masterful smith, it could be reforged.\n\nI gathered a piece of mithril, a black metal staff, and a glittering spearhead to complete the spear of Bearog. By combining them,\nI reforged it into a gleaming blackened spear!",
    "walkthrough": "Find the three pieces of the spear. A piece of silvery metal can be found in Moria, a black metal staff loads on Nagash in the \nAnduin Vale and a glittering spearhead loads in the skeleton in the Collapsed Escape Route (enddennw from Vale Ford). Rarely it \nmight load in goblin corpse at water serpents. When you have all the pieces, as whitie, go to the The Rivendell Smithy, have all \nitems in your inventory and type 'mend spearhead'. As darkie, go to a Blasted Furnace in the Goblin Town, and type 'mend spearhead'.",
    "reward": "a blackened spear",
    "achievement": "You found the pieces of the spear of Bearog and reforged it."
  },
  {
    "zone": "The Anduin Vale",
    "quest_name": "Warg raiders",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Wolf Glade; Small Village northwest from Ingrove",
    "objective": "Assist Beorn in defeating the terrible warg raiders",
    "description": "As I traversed the lands east of the Old Ford across the Anduin I found a belt of tall and ancient oak trees. These oaks surrounded\nthe farmstead of Beorn, guardian of the those lands. I caught Beorn in a good mood and, by the fire in his Hall, he shared with \nme stories about the area. One story caught my attention; the one in which he talked about how raiding parties of strong wargs and\norcs would come and raid those lands in winter, when food in the mountains was scarce. He spoke about the difficulty in handling \nthese strong and cunning raiders led by a might warg he dubbed the Warg Chief. This mighty warg had thwarted Beorn's every attempt \nto stop him. I left the farmstead with the intention of assisting Beorn and his people against these dreadful raiders.\n\nIt was a cold winter night under the full moon when signs of danger could be seen all over the Vale. Flocks of birds would suddenly\ntake flight, as if fleeing from a danger that could not yet be seen. And then they came the Wargs and Orcs, just as Beorn had described.\nThe noise of their marching upon the lands of the Beornings preceded them and in their wake they left nothing but death and destruction.\n\nAfter a long battle with the minions of Sauron they were finally defeated. Despite his attempts to escape, the Warg Chief was felled\nand his corpse lay on the field. I claimed his head as token of his defeat and presented it to Beorn. He was thankful and impressed\nat my deed and after expressing his thanks wrote a letter for me to give to Loryen, chieftain of the village of Ingrove. Upon reading\nthis letter Loryen and the people of Ingrove welcomed me as one of their own!",
    "walkthrough": "Every full moon during winter, a huge pack of orcs and wargs spawns at the Wolf Glade southeast of NOC, and marches to the Beorning \nvillage near Ingrove. It bashes the exits into the village, kills all the mobs there, and then returns to the Wolf Glade and \ndisappears. The pack apears each full moon during Afteryule, Solmath, and Rethe, so it can happen 3-4 times a MUME year depending \non the moon cycle phase (the phase changes only when the calendar is restarted). Kill the warg chieftain, butcher its corpse, and \nbring the head to Beorn. Beorn will give you a sealed letter in exchange for the head. Give this letter to Loryen, in Ingrove and \nyou will receive citizenship.",
    "reward": "Ingrove citizenship",
    "achievement": "You assisted Beorn in defeating the warg riders of Anduin Vale."
  },
  {
    "zone": "Blue Mountains",
    "quest_name": "Hunting for antlers",
    "target_player": "Whitie, below hero",
    "repeatable": false,
    "location": "Inside a Hunter's Cabin, (all n, all w, all n, e, n, w from Forlond gates)",
    "objective": "Bring back the antlers of the noble stag",
    "description": "I sold several furs and pelts to the elven trapper near Forlond and he revealed that he had heard from Dwarven traders that a \nmajestic stag has been seen. This stag is as majestic as any seen in living memory! If only I could find and fell the beast I'm \ncertain the trapper will reward me for its antlers.\n\nThe trapper was delighted with the antlers I was able to bring to him. They hang on his wall as a reminder of the undisputed beauty \nof the animals created by Yavanna. As a reward he furnished me with a yew longbow, an incredible piece of carpentry and a fine \nweapon for a hunter.",
    "walkthrough": "Trapper will offer his quest only if you sell him enough pelts or furs (if he's out of money, buy some pelts from him and sell \nthem back), and if the noble stag loaded. Then he will start talking about old times - just wait and nod when he asks you if you \nagree. After that go and kill the noble stag - e n w n w 2n 3w s are his 6 rooms. You are not forced to kill him yourself, you are \neven allowed to not have him on your trophy - just ask someone to help you if you can't kill him. Butcher the corpse, bring the \nantlers to the trapper and give them to him. You can solve this quest a maximum of 2 times - the second time you need to give \n(not sell!) him about 10+ furs/pelts.",
    "reward": "Yew longbow, quiver with 12 ash arrows.",
    "achievement": "You brought the antlers of the noble stag to an elven trapper."
  },
  {
    "zone": "Blue Mountains",
    "quest_name": "Nordri's task",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Blue Mountains, Nordri's Treasure Chest",
    "objective": "I must prove to Nordri that I am worthy",
    "description": "Nordri's grandfather knew how to brew a special draught that makes the body heal more quickly when injured. I could find many uses \nfor a powerful potion like this! The problem is that Nordri doubts that I am as capable as I say I am. To prove who is right he \nhas challenged me to fetch him some items he has wanted for a long time.\n\nHe was pleased to see me bring him a marjoram plant, a jade bracelet, a huge silvery bracer, and a ginseng root.\n\nWith the last item handed over, Nordri was true to his word and shared his grandfather's secret. It seemed quite complicated so I \nwrote the whole process in my herblore journal so I can refer to it later when I need to mix it. We parted as the very best of \nfriends, I think this friendship will be life-long, I certainly intend to call on Nordri again.",
    "walkthrough": "Ask Nordri \"herblore\", then he will talk for a while. When he says \"But there is a price.\" say 'price' and then say 'yes' when \nNordri asks whether you agree. Listen to him, write down what he wants and go collect the items. Lowlevels can find the required \nitems/weapons/herbs around BM or even inside the city - just ask some dwarf to check private the dwarven shops inside. Legends \ncan be asked for a crystal from Willow, a topaz from Mormaeg, a golden nugget or a jade bracelet from Moria, or even a shining \npiece!",
    "reward": "",
    "achievement": ""
  },
  {
    "zone": "Blue Mountains",
    "quest_name": "Theddin's mines",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Blue Mountains, Barakun-dum (from secretary 2w 4s)",
    "objective": "Brave the mines of Ered Luin for wealth and fame",
    "description": "I swore an oath to Theddin the Foreman to not defile or alter the work of the dwarves, nor wield a blade or speak against any dwarf\nin order to enter the uncharted caves of Ered Luin. I was told that many dangers lurk within the heart of the mountain but it was \npossible to explore the mine to find wealth and fame.\n\nI found my way through the spider-infested tunnels of Theddin's mines to wealth and fame.",
    "walkthrough": "To enter the mines, wait until Theddin comes and say to him 'explore' after a long conversation; then go down. Talking to Theddin \nis needed only once, next time you can just pass. Though, dwarves will not allow an evil-aligner to enter, but there is another \nentrance (heavydoor) from outside BM - high str is needed to open it though. Mine zone is muddlled, find your way to the spider \nlair and kill all spiders on the way.The spider at the exit 'cover' has a key on its corpse. Loot the key then head d, s. When you \nnotice a glinting item, type 'reveal key'. The spider's key is for the door before the chest (in the north-western part of the\nmines, some n of mineshaft up), the glinting key is for the chest.",
    "reward": "Steel-shafted mattock, metal wall shield, amethyst, some gold in chest",
    "achievement": "You have found your way through the spider-infested tunnels of Theddin's mines."
  },
  {
    "zone": "Blue Mountains",
    "quest_name": "Thror's bones",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Blue Mountains, Felak Uzbad Khuzdul; Moria.",
    "objective": "Find and return Thror's bones in Khazad-dum to Thorin",
    "description": "High on the shoulder of a spur of Celebdil I found a small cavern with a crazed dwarf. He spoke in a harsh, ragged voice and \nmuttered that Thror's bones were somewhere in Khazad-dūm and that they must be returned to Thorin.\n\nI found the lost bones deep within the Mines of Moria and returned them to King Thorin II. The king expressed his gratitute by \nhanding me the Hammer of Belegost as well as stating that I was always welcome within his halls.",
    "walkthrough": "Loot a string of bones from one of Moria mobs and bring them to the King Thorin. Mobs that can load the string of bones are: \nMuranog, Hshkhlahk, Karcarak, Umuk, Shaghosh, Mezagor and Bulag. Also stationary patrol in the Muranog area, black troll in the \nBalrog area and great orc down in Mustering Stairs. String can only load if Hammer of Belegost is already loaded on King Thorin, \nso it is advised to examine the king prior to checking the Moria mobs. With the string of bones, you will be allowed to descend \nto the deeper levels of the dwarf homes where the King's throne is located even if you aren't a dwarf.",
    "reward": "The Hammer of Belegost, Blue Mountains citizenship.",
    "achievement": "You returned Thror's remains, once lost in Khazad-dum, to Thorin."
  },
  {
    "zone": "Blue Mountains",
    "quest_name": "Wood for Vig",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Bottom level of Blue Mountains, Vig's Shop",
    "objective": "Find wood to keep Vig's smelter running",
    "description": "I was checking in on Vig to see what was new in his stock of mining equipment and he happened to mention a problem he was having. \nHis supply of wood is running out and without more wood he can't turn the miner's ore into metal. I have heard that Vig is very \npicky about the fuel he uses, only the oldest trees in the forest should be cut down and the younger saplings left alone to grow \nfully. Oh, and I better not forget to take an axe!\n\nThe wood has been delivered and Vig paid; not all that much but I guess he has a business to run. At least the miners can continue \nto sell him their ore now.",
    "walkthrough": "Vig the Smelter sometimes runs out of logs for his fire. When he does, he will ask people who come into his shop if they're willing \nto go out and get him some wood. Assuming that you agree to do so, you should go and get an axe, and then go out into the Dense \nForest just east of the Dwarf Homes (from \"End of the Worn Trail\", s 3e). Wander around the Dense Forest, and eventually you will \nfind a \"A tall and sturdy oak tree\" (it will be clear, when you see it, that this is *the* tree, not just one of the innumerable \ntrees in the forest). In case this tree has been chopped already, or simply not popped - there are two other such trees, one as \ns 2w 6s 4e 4s from the same place, and also somewhere north of the river, like s 3e 2n 5e. Chop it down, get the wood, bring it \nback to Vig, and collect the reward money. One tree is s2 e s2 e s e 2s. Just a small warning: the Dense Forest is a maze (i.e. \nif you go east from tree, then west, there's no guarantee that you'll wind up where you started). If you need to get out of it in \na hurry, spam north/west and type 'exits' after each step - to see where the exit out to the trail is (this works during the day \nonly though). In this forest there are 3 huge black wolves, so it's kinda dangerous for low level characters.",
    "reward": "15 silver",
    "achievement": "You provided just the right kind of wood to Vig the smelter."
  },
  {
    "zone": "Eregion",
    "quest_name": "Amanrandil's acolyte",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Alkarambar (temple east of the ruined causeway east of Tharbad).",
    "objective": "Locate the acolyte who was travelling to Isengard",
    "description": "Amanrandil is troubled. Several months ago he sent his strongest follower on a quest. A large pack of wolves and wargs had gathered\nnear Moria and the follower was dispatched on an urgent mission to travel to Isengard and warn Lord Saruman of this dire news. \nThe acolyte did not return and nothing has been heard of him. Amanrandil and his remaining followers must guard the sanctuary and\ncannot venture out to look for their lost friend. If I could find what happened to the acolyte it would surely set Amanrandil's \nmind at rest.\n\nThe acolyte's diary confirmed Amanrandil's worst fears. The missing Daedeltir perished during his mission and will never return \nto join the prayers at Alkarambar. With the fate of the acolyte confirmed Amanrandil and his followers can pray for his spirit \nto rest.",
    "walkthrough": "This quest will trigger when a player enters Amanrandil's room - usually when Amanrandil is waiting in the cubicle between speeches. \nHe will give a speech about how he sent a follower on an errand, and the follower never returned. Amanrandil will be happy when \nyou find the diary of his follower and deliver it back to him. The diary loads either in the belt pouch worn by Wyrdda; animist \nor the twisted beast in Wulfston (Broggha's village); in the pouch worn by the orkish chieftain in Dunland or the pouch worn by\nhis shaman Mordrath and possibly more.",
    "reward": "sacred cloak, ceremonial dagger.",
    "achievement": "You retrieved the diary of Amanrandil's emissary, who perished on the way from Isengard."
  },
  {
    "zone": "Eregion",
    "quest_name": "Book of Kormanolė",
    "target_player": "Anyone",
    "repeatable": true,
    "location": "Eregion, Ost-in-Edhil",
    "objective": "Seek the book of Kormanolė in Ost-in-Edhil",
    "description": "Long and with sad voices have the Elves remembered the events of Ost-in-Edhil. It was here that the elven smiths, chief of which\nwas Celebrimbor, forged mighty rings of power. However, unknown to them was the fact that Annatar, who assisted them in this, was \nnone other than Sauron, servant of Morgoth. Long have the mysteries of these ruins intrigued me. While I was in Imladris, I inquired\nabout the once mighty citadel to Elrond himself. Elrond elaborated on the story of Ost-in-Edhil and admitted to concern about someone\nseeking the knowledge hidden therein. He asked for my assistance in this matter and I accepted to explore the ruins in search of \nthe Book of Kormanolė, written by Celebrimbor and holding the knowledge required to forged the mighty rings of yesteryear. To aid\nme in this quest he provided me with an ancient key attuned to the book, but magically prepared so that, should I be unsuccessful,\nit decay lest it falls in the hands of the Enemy. He also suggested I seek an Elf by the name of Maranwė who is as old as the city\nitself and knows its secrets like no other.\n\nI read the book and a gemstone of exquisite beauty was imprinted on my mind. I seem to recall a gemstone whose hardness and rare \nblue transparency give off a vitreous luster, a gemstone whose deep green colour is cast upon its surroundings when touched by \nillumination, and a gemstone whose fiery blue glow emanates from deep within.\n\nI entered the ruins of Ost-in-Edhil from the north and sought out Maranwė. I found him wandering the ruins and, upon my inquiry, \nshared with me the existence of an inner chamber. A place in which only the most venerable amongst the Noldor would enter, and \nthose properly recognized as their true friends. He told me they were identified by using a bracelet given to them by the Elves. \nI pondered on his advice and continued my exploration of the ruins. I found two obsessed Men, excavating the ruins. They asked \nfor my help in recovering a book. I assumed their presence there was likely the source of Elrond's concern. Upon finding the Book \nof Kormanolė hidden in one of the upper chambers, I proceeded to separate myself from the excavators and, eventually, chose to\ncollect my reward. Was it the wisest choice? I guess in time I will figure it out.\n\nWalkthrough:\nBoth darkies and whities can solve this quest, thus I will write solutions for both sides. Whities get the quest from Elrond, \ndarkies from the BN Sage: ask them about 'Ost-in-Edhil' (not case-sensitive). You can ask them in any language, but Elrond doesn't\nunderstand Westron well, as well as the Sage doesn't speak Orkish. So, if you speak Sindarin/Morbeth well, ask in these languages. \nThey will start to talk if no one is solving this quest at the same time (if they don't it means someone is solving it already, \njust wait a bit), and then they will give you a key. Then go to the castle in Ost-in-Edhil and find the tower in the center of it.\nBeware: there are many of different DTs in the area - the eastern part of the zone is 4 DTs, 3 of them are timed ones (slowly drag\nyou to the east; can stay in room aprox.13 sec); vines trap you and slowly kill (considered DTdeath though) - but you can kill \nvines of course, like hero level needed; n and e from the mother eagle on the top of tower are falls (noflee). At the bottom of \nthe tower there is a door which can be opened only with an amethyst: type 'put amethyst inset'. To get it back later, 'get amethyst \ninset'. Wait till the door opens and proceed n. You can get the gem back (as both close and open are delayed), but then you will be\nstuck inside - so be sure that you know how to get away via underwater. Here starts a noport area. In the center of this hidden \nsquare is one more instant DT. Somewhere in this area loads hidden main quest item - Book of Kormanolė. There are four possible load\nspots. 2n 3e n and s; 2n 3w n and s. Type 'reveal book' to find the book. There are 2 excavators in this area, and they will ask you\nto give them the book: don't - they are minions of Saruman. If you give them the book, they will reward you with a whole 2 gold, \ngive you a 'treasure map' leading to DT, and disappear (no way to track, kill and get the book back). Then the quest divides into \ntwo parts: either bring the book and the key back to Elrond or the Sage and get your reward (from Elrond - silver-leaf brooch; \nfrom the Sage - around 20 gold), or claim the book and forge a ring.\n  If you decide to forge, in the northern part of the square is the entrance to the underground part. There live several bats and\n4 scaled guardians. These mobs instafollow, call each other, instahit, choose random targets and can instaheal themselves for like \n1/3 HPs. So: at least 1 buffer and 2 nukers need to kill them. Guardians can't follow further north than 2s from the entrance, and \nalso to Gem/Glass/etc -works (max w and max e rooms), so rest there after each one is killed. First buffer enters, guardians hit \nhim, then casters enter, nuke one dead and leave n, then only buffer flees. Have swim off while doing guardians, otherwise you \ncan flee into water (central room); 2n from it is instant DT, and as one who flees from guardians will spam n to reach safe room, \nit can end in DT here. Though, if someone dies here, their corpse will be recoverable: current will drag it southwards, away from \nthe DT. Before you fight, unfollow everyone in case you flee. You don't want to meet up after flee and lead each other onto the the \ncollapsing bridges. After you kill first, go 2e one by one - otherwise bridge will collapse under your feet, throwing you into the \ncurrent below. Kill the second guardian (now safe room ne from it), get full, then someone must lure guardians from the central \nroom - nuke them dead too. Then find the golden band (in each room in this area - random too), it is sometimes hidden, sometimes \njust lies on the ground.\n  The level is symmetrical here:\n\n       !\n      S*=*S\n       +@+\n      S*=*S\n\n    ! is where you enter\n    = is collapsing bridge\n    S are safe rooms\n    * are Coruscate Hall\n    + are rooms with a single guardian\n    @ has 2 guardians and the DT to north.\n\n  Central room is the start of the noboat current. 2n from this room is a DT; some s/d (follow current) - underwater room where \nin the skeleton loads a hammer which helps to fix your armour (even fine/shining!) as a whetstone fixes weapons. All swim on. One\n(not the leader) must wear a harness (on chain in room 1w from central). He must enter the central room and open silverpanel. It \nis a delayed door in a room with the current, but the harness will keep him there while he opens the door. When the door is open, \nremove harness, narrate for others to come, and quickly go d. Wait till water goes away and metaldoor opens, then go 2w to the \nnoldor statues. Btw, you cant remove the harness while fighting, and cant flee either - so dont wear it while mobs are alive, and\ntry not to be caught by opposite side players. You can not forge a ring by your own choice. At one time one ring can be forged only; \nwhich one exactly is written in the book. Ring must be forged from the band and some gem. There are five types of jewelled rings. \nThe book can give you a hint - which ring can be created on the current repop: it's the colour of the gem.\n\n-Red glow = ruby\n-Maroon = garnet \n-Hard and rare blue = topaz \n-Fiery blue = opal\n-Deep green = emerald \n\n  These rings are considered powerrings, and can not be worn at the same time as old powerrings (ruby/iron/copper/root). To forge \na ring rest full, and try to pass statues. The higher your will, the higher the chance you have (no alignment involved though). \nIf you fail - just rest full and try again (more chance to pass with full stats). Noldor can pass statues without any problems; \nUnqalome bracelets can help non-noldor to pass. If you are neither Noldo, nor know the Unqa zone to get a bracelet, get a dispeller \nhere: statues are not alive (not mobs but items, in MUME terms), they don't block entrance themselves - their magic does. With no \ndispeller, just try to walk in (sometimes takes an hour RL or more). Once you are in, wield the band, hold the gem (or vise versa) \nand 'forge ring'.\n  Forging a ring is a delayed action. If you are interrupted while doing it, or you interrupt it yourself, the ring and the gem \ndisintegrate. If you have a wound that bleeds on a tick, it will interrupt forging also. Thus make sure you don't have any kind \nof wounds (it is rare, but has happens that unbound light wound becomes deep). Once you leave the zone all mobs repop straight away. \n  Some more notes: \n-Only the person who read the book can forge. The knowledge decays so you can only do it for a limited (random) period of time \nafter. Don't know how long exactly but sometimes 2 RL days is too long, and sometimes a RL week is ok.\n-After crafting 50 jewelled rings, you can choose epithet 'Ring-maker'.\n-To use the cross-pein hammer you must make a camp fire, hold the hammer, remove armour then 'use hammer <armour>'. Cant repair \nmithril armour\n\nComplete list of \"gem - effect\".\n    red ruby - manaregen +4, affects you by 'lethargy' when you remove it (slows manaregen 5 ticks)\n    topaz    - +2str once per day, affects you by 'tiredness' when you remove it (-1.5 moveregen 5 ticks)\n    garnet   - cure critic 3x per day, affects you by 'hagardness' when you remove it (-5 ob)\n    opal     - scouting ring, allows you to search adjacent rooms for enemies, blinds you at the beginnings of next 6 ticks when you remove it; to use it - 'look \"exit\"'\n    emerald  - remove poison, affects you by 1-2 random poisons when you remove it instantly (unless you save - thus orcs can get no poison at all)",
    "walkthrough": "",
    "reward": "brooch from Elrond, gold from Sage or jewelled ring.",
    "achievement": "You have forged <amount> jewelled rings with four different varieties of gem stone.\n  </amount></armour>"
  },
  {
    "zone": "Eregion",
    "quest_name": "Craft of the Noldor",
    "target_player": "Noldor Elves",
    "repeatable": true,
    "location": "Ost-in-Edhil, Riverbluff Walk",
    "objective": "Collaborate with Maranwe to enhance your focus",
    "description": "Having conversed with Ciryariel, she revealed an opportunity to further enhance my focus through the ancient art of Noldorin \ncraftsmanship. Ciryariel imparted that Maranwė, a skilled artisan with knowledge harkening back to the days of Fėanor, could teach \nme the ways of refining my focus. Maranwė was said to be near the ruins of Ost-in-Edhil, and Ciryariel suggested seeking him out.\n\nMaranwė greeted me warmly in Ost-in-Edhil, acknowledging that it was always good to see one of the Noldo. He mentioned that few \nof our kind had passed that way since the days of Celebrimbor. He sensed that I had received the blessing of the Valar and revealed \na secretive Noldor skill to enhance my focus. He instructed me to fetch a silver filigree and a bar of gold, urging me to search \nthe old places of power for the required materials.\n\nUnder Maranwė's guidance, I melted a gold bar in the forge, carefully applying the provided tools. Following precise instructions, \nI embedded a filigree, infused the object with the power of the Valar, and successfully upgraded it to accept a minor gem, earning \nthe achievement of mastering the Noldor's ancient crafting skill",
    "walkthrough": "Find a broken filigree at deep inside OiE, it loads same place of cross-pein hammer (no need for cross-pein hammer) inthe skeleton. \nThen bring broken filigree to Ecthelion, then type 'mend filigree' to get silver filigree. A bar of gold is also needed, you can \nbuy it in shops. After that go find Maranwe near OiE and give him a bar of gold and a silver filigree then follow him to his chamber. \nBefore entering the chamber abandon mount, order charmies sleep, drop everyone - only you can follow Maranwe in the chamber. In \nthe chamber type 'forge \"focus\"' to add filigree to the focus, creating extra slot and getting and a chievement. Go to jeweller \nto embed item to focus, which shall be only a minor gem.\n  \n<b>Reward:</b>\nextra slot in focus",
    "reward": "extra slot in focus",
    "achievement": "You have used the ancient skill of the Noldor to enhance your focus."
  },
  {
    "zone": "Eriador",
    "quest_name": "Aldereon's letters",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Elven village n of Road to Grey Havens, The Refuge",
    "objective": "Learn the secrets of the walking herblore",
    "description": "Aldereon the wise knows the secret to create a potion to restore my energy quicker. He is willing to share this secret in return\nfor a favour from me - he has several letters addressed to other wise people throughout Arda and I must deliver them for him. \nFortified with a sample of his brew I'm ready to set out on this adventure.\n\nShould I forget who the letter is for, Aldereon has also written the recipient on the envelope. If I lose a letter, he said he'd\nwrite a new one if I ask him about the lost letter.\n\nWith the favour completed, Alderon was true to his word: I will now be able to brew the walking potion before I set out on long \njourneys. I recorded the potion components in my herblore journal so that I won't forget it.",
    "walkthrough": "Ask Aldereon 'herblore' and he will ask you to deliver letters (around 5 for level 1 to more than 15 for high-level) to his friends.\nThe higher your level is, the farther away you will have to travel to meet the mobs. It is better to do this quest at the level \none: then Aldereon will ask you to visit mobs in nearby cities. Legends very often are forced to travel to Rivendell. \n  Other recipients for his letters are: the Old Wise Hobbit (not far east from Aldereon, but you have to swim across a small lake),\nvarious guildmasters in most cities, and various hermits who live in seldom visited places in Arda. The GH hermit lives 1 zone w \nfrom Aldereon, the Shire hermit - some w and n from Mishel Delving, the Fornost one - 10s 3e d 2s from the gates, the Greenway one\n- s max e s e open bush e from the Ancient Wall along the Greenway.\n  \n<b>Reward:</b>\nWalking herblore, 200 xp per your level for (after level 25 5000 xp) each letter.",
    "reward": "",
    "achievement": "You have delivered lots of letters from and to Aldereon, and learned the secret of preparing walking potions."
  },
  {
    "zone": "Eriador",
    "quest_name": "Angrim's ghost",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "",
    "objective": "Aid Angrim's ghost in fulfilling his oath",
    "description": "It was at an abandoned watch tower in the Weather Hills that I ran into a shadow coalescing into the shape of a young soldier. He\nwas wearing the garb akin to that of the Dśnedain of Fornost and spoke of an oath to his betrothed, Sulien. He was surprisingly \nfriendly and asked that I help him find his love.\n\nI wandered about with Angrim's ghost in tow until we came upon the ghost of Sulien. Angrim and Sulien cried out when they saw \neach other; but it was then clear that they were both under the spell of an evil sorcerer. The ghost of the evil sorcerer, Halamor,\nthen revealed himself and a battle erupted between us where Angrim and I found victory. Halamor's death freed Angrim and Sulien \nfrom the evil sorcery that bound them, and Angrim managed to fulfill his oath.",
    "walkthrough": "Angrim's ghost will follow you when you enter his room. Lead him to the Fallen Inn, some ws from Angrim's ghost. Go nu from front \ndoor and help Angrim's ghost to kill Halamor's ghost. After killing the ghost, both Angrim and Sulien ghosts disappear.",
    "reward": "2000 xp",
    "achievement": "You have aided Angrim's ghost in fulfilling his oath."
  },
  {
    "zone": "Eriador",
    "quest_name": "Araduin's request",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Bree, Ranger's Retreat",
    "objective": "Araduin will point me to quests around Bree-land",
    "description": "In the middle of Bree, I came across a weathered and grizzled ranger. After telling me about his extensive travels, including to \nElvish lands to the east, and Dwarvish caves to the west, he talked about how Bree pulled him in, with an abundance of opportunity \nfor the willing adventurer. He told me that I could come to him when I needed work in the city, and he would point me toward it.\n\nThe ranger told me that I have served Bree well, and wishes me success in my adventures.",
    "walkthrough": "Araduin will point out quests that are available around Bree. Return to him after finishing all of them for the Achievement.",
    "reward": "",
    "achievement": "You helped Araduin, a ranger in Bree, with many tasks around town."
  },
  {
    "zone": "Eriador",
    "quest_name": "Arrowhead hunt",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "",
    "objective": "Find the missing delivery of arrowheads",
    "description": "The skilled fletcher in Bree asked me to look into why an expected shipment of arrowheads had not arrived yet. She said that Olly,\nthe proprietor of Olly's Tavern in Fornost, was in charge of facilitating the shipment.\n\nI need to speak with Olly, the proprieter of Olly's Tavern, in Fornost, and ask him about the arrowheads.",
    "walkthrough": "The skilled fletcher wants you to visit Olly in Fornost and ask him about the arrowheads delivery. Ask Olly 'arrowhead' Olly will\nsend you to a Manthor's tower, a merchant that trades in weapons. The tower is located about halfway between Fornost and Bree, \neast of the Road to Fornost. When you enter the tower Manthor will talk about his business. Ask Manthor about 'arrowhead' when \nhe's done talking to you. Be prepared for for a fight! If you win, he will either give you the map or drop the map to the arrowheads.\nThen hold the map and 'look map' to get a general idea of where the arrowheads are hidden. Then with the map in your inventory, \ntype 'search'. This will let you know what direction you need to head to find the arrowheads. If you are in the correct room, \n'search' will reveal a bag full of leaf-shaped arrowheads. Take this bag back to Bree and give it to the skilled fletcher.",
    "reward": "a quiver of 20 leaf-shaped arrows (pre-enchanted), 5000 xp",
    "achievement": "The skilled fletcher in Bree gave me a quiver of leaf-shaped arrows."
  },
  {
    "zone": "Eriador",
    "quest_name": "Azaghāl's rod",
    "target_player": "Any",
    "repeatable": true,
    "location": "nw Forlond, Mystical Ring; for rod: Roadside Alehouse, Sheperdess' Home",
    "objective": "Find the entrance to the tomb of Azaghal",
    "description": "I found an elven shepherdess who told me of the battle of Nirnaeth Arnoediad where many heroes fought to rid Arda of Morgoth and \nhis minions. Many mighty lords fell in this battle such as Fingon the Noldo, Huor of Dor-lómin, and Azaghāl of Belegost. When she\nfinished her tale she gave me an ancient oaken rod and mentioned she found it in the hills to the southwest. Perhaps I will find \nmore there.\n\nI used the ancient oaken rod to solve the mystery of the mystical stone ring and unlock the tomb of Azaghāl, Lord of Belegost. \nI entered the tomb, navigated my way around the traps and stone statues, and found my way to his burial chamber.",
    "walkthrough": "First you need to receive the oaken rod from either the young Dwarf or the Shepherdess (just enter their rooms, and: ask the dwarf\n'Unnumbered Tears', or ask the elf 'Nirnaeth Arnoediad'). Listen to the long story, after that one of them will take the rod from \na sack and give it to you (though, it loads rarely, with a chance of like 10-15% per zonerepop).  Go to the mystical rings some \nsw of the Shepherdess and look at the glyphs on the rod. There are seven different types of glyphs on the rod, and the mystical \nrings consist of seven stones with different paintings. Now simply place the rod (ex. \"put rod wedding\") in the right stone and \nin the right order. Here is a list of glyphs vs. stone paintings. \n\n   Mistletoe - Wedding\n   Tree - Hunt\n   Flame - Battle\n   Cloud - River\n   Star - Mountain\n   Harp - Feast\n   Crown - Funeral\n\nMore info under Strategy.",
    "reward": "Large visored helmet, full chain mail set, battle axe, 2H axe and sometimes metal breastplate.",
    "achievement": "You have seen the dwarven burial chambers underneath the mystical stone ring."
  },
  {
    "zone": "Eriador",
    "quest_name": "Bandit's note",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Tower Hills, Hunter's Cabin",
    "objective": "Recover a bandit's note for a hunter in the Tower Hills",
    "description": "",
    "walkthrough": "After completing quest 'Snake hunt' and 'Rat infestation' the hunter will ask you to help out with bandits. Nod when asked and \nhead to the Plateau near the road to Grey Havens. Kill a bandit, loot the crumpled, mud-smeared piece of paper and bring it back \nto the hunter.",
    "reward": "pot helm, longspear, 1 gold, 1000 xp",
    "achievement": "You aided a hunter in keeping the bandits of the Tower Hills at bay."
  },
  {
    "zone": "Eriador",
    "quest_name": "Barman's errand",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Bree, The Prancing Pony Lounge",
    "objective": "Deliver a warning to the Fornost barman",
    "description": "I was given a letter by the barman in Bree at the Prancing Pony Lounge. He wanted me to warn the barman in Fornost at the Crown \nof Arnor Inn about a shady wine merchant that was travelling there. The wine merchant hadn't paid his bar tab in Bree and wanted\nto save the Fornost barman from the same treachery.\n\nThe barman of the Crown of Arnor Inn was very thankful that I was able to deliver the letter before the arrival of the scandalous\nwine merchant.",
    "walkthrough": "After entering the Lounge, the barman will ask if you have a moment. Say 'yes' and then you will be asked to bring a letter to \nthe barman in Fornost. The barman is located in the Dining Hall of the Crown. Take the letter to Fornost to finish the quest. \nThe letter is no-rent/sell.",
    "reward": "a map of Fornost, 1000 xp and 500 tps",
    "achievement": "You warned the Fornost barman to be wary of the crooked wine merchant."
  },
  {
    "zone": "Eriador",
    "quest_name": "Beer and axe",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Bree",
    "objective": "Bring Clint a beer and recover his two-handed axe",
    "description": "It was in Bree that I met a small dwarf with a red nose who exclaimed that nearly all of his possessions were stolen by a band of\nsmugglers. Indeed, pretty much all he had left were his blue clothes! He requested that I fetch him a beer and recover his two-\nhanded axe. If so, he would then go with me to the end of the world.\n\nI gave Clint a beer and found his two-handed axe to much joy on his end. He followed me and said that we had better be off on an \nadventure!",
    "walkthrough": "To start this quest you need to complete some other quests in Bree before. Find Clint and give him a bottle of beer and a two-\nhanded axe. Clint wanders around Bree, look around to find him.",
    "reward": "Clint. He follows you around like mercenary and assists in fights. Also you can ask him to bash doors, must use exact door name for it.",
    "achievement": "You were nice to Clint the Dwarf and recovered his axe."
  },
  {
    "zone": "Eriador",
    "quest_name": "Berries for Karōlck",
    "target_player": "Darkie",
    "repeatable": false,
    "location": "Research Chamber",
    "objective": "Deliver some baneberries to Weathertop",
    "description": "",
    "walkthrough": "First find some baneberries. They load in different places (look under Herbs). Torc/bn can buy baneberries also from DG. Have \nbaneberries in your inventory and enter the Necromancer's room. He will snatch the berries from you and give 6 gold in return. \nHe also offers you to read a book. Ask him 'read book' and he will give you libram.",
    "reward": "6 gold, libram, +tps",
    "achievement": "You delivered some baneberries to Weathertop and earned Karōlck's favor."
  },
  {
    "zone": "Eriador",
    "quest_name": "Big John hunt",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Bree, White Timber House",
    "objective": "Eliminate the Bree smuggler threat once and for all",
    "description": "Word has reached the ear of the ranger in Bree about the suspected smuggler camps south of Bree. His intent is clear: to eliminate\nthe threat they pose once and for all!\n\nThe ranger in Bree had been troubled by the increasing smuggling activities south of town, all believed to be orchestrated by the \nnotorious Big John. I ventured to Big John's hideout, where, after a fierce and bloody battle, I emerged victorious and claimed \nthe ring he wore as proof of his downfall.\n\nUpon returning to Bree, the ranger was relieved to hear of Big John's demise and rewarded me with a powerful crossbow and bolts \nfor my bravery. The smuggling threat to Bree is no more, but the ranger warns that vigilance must remain, for lawlessness is never\nfar from Bree's borders.",
    "walkthrough": "A grizzled old ranger lives in the White Timber House in northern Bree. Say 'yes', when he asks if you \"Care to hear what's been \nstirring up?\" After that he offers you a mission to bring Big John to justice, say 'yes' again and head out to kill Big John. \nHe's located south of Bree in the middle of the Greenway. Kill him, loot the orante ring and bring it back to the ranger.",
    "reward": "5000 xp (2500 xp after), crossbow (max-white enchant), bolt-case (7 random bolts)",
    "achievement": "You have helped the Bree ranger eliminate the smuggler threat once and for all."
  },
  {
    "zone": "Eriador",
    "quest_name": "Black Dagger Guild",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Fornost, Olly's Tavern",
    "objective": "Follow Olly's information along the Ruined King's Road",
    "description": "I paid Olly within his tavern for some information to reach the Black Dagger Guild. I was to head out through the palisade gate \nand follow the Ruined King's Road until I found a stone with a black dagger painted on it. Upon finding the stone, I was to head \nnorth until I reached a ruined house where I was to open the hiddenrock, head down into the ruin, and then knock to gain access.\n\nI seem to have forgotten the password to enter and should return to Olly if I want to return to the Black Dagger Guild.\n\nI found the Black Dagger Guild and dealt with the worst robbers of Fornost within their secret hide-out.",
    "walkthrough": "Give Olly 2*(your level) silver/celeb coins and he will tell you the password for the Black Dagger Guild. Then from the w gates\nof Fornost go n 4w open hiddenrock d; call and say the password after the guildmaster's request.",
    "reward": "Access to thief guildmaster.",
    "achievement": "You have dealt with the worst robbers of Fornost and visited their secret hide-out."
  },
  {
    "zone": "Eriador",
    "quest_name": "Dangerous dark wolf",
    "target_player": "Whitie; lev21",
    "repeatable": false,
    "location": "Bree, Archery Range",
    "objective": "Slay the beast described to you by Beriagon the hunter",
    "description": "Beriagon the hunter in Bree told me of a dark wolf filled with evil like the stories of Carcharoth. This creature recently killed\na young ranger who was traveling from the Sarn Ford. He asked me to travel fifty miles south of Bree, near a toppled statue alongside \nthe road, and find and kill the creature so it menaces travellers no more.\n\nI killed a werewolf and returned to Beriagon with the news. He was grateful, but very concerned to see such an evil creature this \nfar west.",
    "walkthrough": "Last animal Beriagon the hunter asks you to put down is the dark werewolf. Dark werewolf is is located in Greenway, head west on \nroad from toppled statue until hidden exit ferns. As you kill them, this quest automatically reports it back to the quest giver \nfor you. Report back to the hunter.",
    "reward": "7000 xp",
    "achievement": "You have slain the werewolf along the path to the Sarn Ford."
  },
  {
    "zone": "Eriador",
    "quest_name": "Brolg's standard",
    "target_player": "Any, not Zaug",
    "repeatable": true,
    "location": "Rivendell, The Great Library; s of Brolg Tower, Sleeping Chamber",
    "objective": "Brave the darkness of the tomb",
    "description": "<i><b>Whitie quest:</b></i>\nI was wandering through Rivendell when Erestor stopped me. He mentioned that I had found an old battle-standard, a flag from the\nold castle that used to be governed by a noble lord. He sadly explain how the noble lord's tomb had been desecrated after the \ncastle fell and said that the old grave would most likely ridden by evil. He claimed that he had placed the path through the tomb\nin my mind and briefly said something around 'pillars' that might save me.\n\nI remember the path through the darkness of the tomb.\n\nI found the tomb, unravelled the secrets of the orkish battle-standard, and defeated the darkness within.\n\n<i><b>Darkie quest:</b></i>\nMrak was delighted when I returned to him with Brolg's battle-standard. He spoke of an ancient lord's tomb with a hidden treasure. \nHe said that the guards defending the tomb would be out of control, and that something around 'pillars' might save me. He claimed \nthat he placed the path through the tomb in my mind.\n\nI remember the path through the darkness of the tomb.\n\nI found the tomb, unravelled the secrets of the orkish battle-standard, and defeated the darkness within.",
    "walkthrough": "To start this it, kill Brolg the Orkish Shaman, who resides in the tower on the Ancient Broken Road. Word of warning:when he gets\nto bad, he will flee and recall away. You can find him w s 3w s 2w 2n open rockface 2e n from outside the tower door. When he is \nhere, he will summon up to two dark wraiths if you give him a chance. <i><b>Whitie quest:</b></i> Kill him, and loot his belt pouch and his orkish \nbattle-standard. Loot the tarnished silver key from the belt pouch, and take the orkish battle-standard to Erestor in Rivendell. \nErestor will ask for the battle-standard - give it to him, and listen to what he has to say. He will give you the quest.\n<i><b>Darkie quest:</b></i> Bring orkish battle-standard to Mrak, the orkish shaman. Mrak is found in  w s w 5s 3e d e. Give starndard and listen \nhim to get the quest. Now, go to the hidden 'tombstone', which is w s w 3s 6e s from outside the Brolg Tower door. Down from here \nare two stone statues, a stone beast, a glowing spirit, and two dark wraiths. Kill them all. To the north is a secret exit: 'pillars',\nand behind it are a ghost and another glowing spirit. Kill them and the quest is completed. Use the tarnished silver key from Brolg \nto unlock and open the chest in the main room, and loot it. Note: to enter the tomb you need the person on quest (\"keeper of knowledge \nbestowed by Erestor\"), bless and good align. Darkies just need the quest. Without it you will get some muddled damage and be returned\nto the room up from the 'tombstone'.",
    "reward": "3 gold, citrine, longsword, metal wall shield. In the skeleton: metal set, a gem-inlaid knife, two gold rings and a silvery crown.",
    "achievement": "You braved darkness by unravelling the secrets of the orkish battle-standard."
  },
  {
    "zone": "Eriador",
    "quest_name": "Bruzhor's orders",
    "target_player": "Troll/Torc/Morc",
    "repeatable": true,
    "location": "",
    "objective": "Return to Bruzhor with the goblin chieftain's head",
    "description": "Bruzhor the Olog-hai told me of a goblin tribe that had forgotten its tribute obligations to Dol Guldur. This tribe had a new \nchieftain who believed himself strong enough to resist. Even worse, he was attacking other orc tribes in the region and hurting \nthe war effort. Bruzhor wanted this chieftain dead, such that the tribe would follow the orders from the Lord of Dol Guldur once\nagain.\n\nBruzhor said to head east to find the tribe and to bring back the goblin chieftain's head.\n\nI found and killed the goblin tribe's chieftain and brought his head back to Bruzhor as ordered. Bruzhor thanked me for taking \ncare of the little maggot and gave me a reward.",
    "walkthrough": "Bruzhor the Olog-hai wants you to bring him the head of a goblin chieftain who believed himself strong enough to resist him. Bhogh \nlives in the nearby tunnels, kill and decap him for his head. Bring it back to Bruzhor for a reward.",
    "reward": "1-2 flask of orkish draught, 3 gold",
    "achievement": "You reminded the goblins of the Misty Mountains to obey the Lord of Dol Guldur."
  },
  {
    "zone": "Eriador",
    "quest_name": "Ellie's lost doll",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Black Hill Village, Garden behind a Stable",
    "objective": "Help Ellie find her doll",
    "description": "Following a cobblestone path within the Black Hill village that led to the garden behind a stable, I met a young girl with braided\nponytails named Ellie. The freckled girl was sobbing over a doll. Ellie explained to me that her doll was hidden in a cellar by a \nboy named Arnie. She then begged for my assistance, being afraid to enter the cellar alone. Ellie was so upset, with tears in her\neyes, that I decided to help her recover her lost doll and followed her to lead the way!\n\nEllie knew the way to the cellar that needed to be searched, so I followed her quickly hoping she would settle down. She led me \nthrough the stables, the market square, next into the common room of The Foaming Mug, and finally into the kitchen to the cellar \ndoor. I accompanied her down into the dark and cramped cellar, ready to protect her if neccessary! Ellie's mood became more frantic \nas I searched. Finally, I had found the ragged old doll! After I gave her the doll, she hugged me tightly and even called me a hero! \nI followed Ellie back to the garden behind a stable to ensure she arrived safely, and then we parted ways.",
    "walkthrough": "Ellie can be found 2e from Black Hill Market Square. Say yes if she asks if you would go with her to the Tavern cellar. Follow \nEllie when asked and she leads you in there. 'Reveal doll' and give it back to Ellie.",
    "reward": "500 xp",
    "achievement": "You found Ellie's doll and returned it to her."
  },
  {
    "zone": "Eriador",
    "quest_name": "Elven chief's wine",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Elven Chief's House (north of the Road to Grey Havens, west of Aldereon village).",
    "objective": "Recover the stolen barrel of wine and return it",
    "description": "The elven chief is a connoisseur of fine wines, some say his collection of vintage wines is the greatest of any west of the elven\nhomes at Rivendell, at least thats what the chief told me. News of his valuable cellar stock must have reached the wrong people \nand, while he was visiting relatives, brigands broke in and stole barrels of his wine. Rumours abound that the perpetrators are \nhiding out in a cave a some miles west of the village.\n\nWith the barrel of wine returned, the elven chief broke the seal and toasted my good health. Tasting that outstanding vintage again \nhas brought back many happy memories for the old chief.",
    "walkthrough": "Ask the chief of this village about 'wine'. He will tell you about his favourite wine, Old Winyard. If the quest is available, he \nwill inform you that his last barrel of Old Winyard is gone. In this case, ask him about the 'barrel', and he will tell you the \nstory of how it was stolen. There is a bandit hideout to the northeast where you can find 'A small ironbound barrel made of fine \noak'. Bring thr barrel back to the chief. Thieves and brigands in the room will prevent you from taking it, so wait for them to \nleave, or kill them.",
    "reward": "An exquisite wine glass full of wine, +sindarin",
    "achievement": "You have successfully returned the stolen barrel of wine to the elven chief."
  },
  {
    "zone": "Eriador",
    "quest_name": "Elven heirlooms",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "ABR, Stone Courtyard (e from Weatherworn Guard Cave entrance)",
    "objective": "Return the heirlooms of Lorien to the elven trader",
    "description": "I found an elven trader who was recovering from a battle that happened near the Dśnadan camp along the ancient broken road. He \nspoke of an elven caravan that carried chests and passengers between Imladris and Lórien that was assaulted by Olog-hai, breaking \nthe combined forces of the Dśnadan and Elves that were guarding it. Many of the innocent passengers were slaughtered and the \nchests that the caravan carried were stolen.\n\nHe asked me to find a missing key; mentioning that a Dśnadan had picked it up during the battle but had not been seen since. I was \nto use the key and retrieve any remaining elven heirlooms from the stolen chests in return for favor with the Golden Wood.\n\nI found the key to the elven chests and returned a precious heirloom of the Golden Wood to the elven trader.",
    "walkthrough": "Elven heirlooms are loaded in 4 different chests in ABR. Key for chest loads on wild-eyed man in Osbert's Camp which is located in \nthe middle of ABR. Go 4s e from the Covered Bridge over a Confluence, kill the guard, 2 dogs and 2 smugglers there; they guard the \nexit down. Wild-eyed man is locked in there.\nTheres 3 ways to get key: \n-Slap the man when he chokes after you enter the room (he drops the key); \n-Kill and butcher the man (key is in the corpse); \n-Kill and let charmies butcher the man (key is in the corpse).\nOne chest is located in the Leader's Bedroom, just u w 2s e n from the wild-eye man. Kill Osbert to open the chest. \nSecond chest is in the Chieftain's Throneroom, kill Bhogh to open the chest.\nThird chest is in the Natural Throne, 2 huge trolls and stoine troll mother and open the chest. \nFourth chest is in the Hall of the Giants, kill Gukk to open the chest.",
    "reward": "Elven trader restocks his herbal shop.",
    "achievement": "You returned a precious heirloom of the Golden Wood to the elven trader."
  },
  {
    "zone": "Eriador",
    "quest_name": "Elven scout's report",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "The Elven Scouts's Hideout (from ABR thornbushes s max e s w, call or pick/open hillside); Rivendell",
    "objective": "Deliver important information to Elrond at Imladris",
    "description": "I found myself in the lands south of the River Bruinen, in the land near the camps of the Ohurk-uai orcs led by the fearsome shaman \nBrolg. I recalled the existence of a -scouting- outpost by a high hill, south of a small stream. I reached the hill and called \nnear a door cleverly camouflaged on the hillside. In this hideout I met two of Elrond's scouts who asked me if I was headed to \nImladris. I shared with them my intention to reach the fair valley of Rivendell. One of them asked me to take a letter on their \nbehalf to Elrond, master of Imladris. I agreed to serve as courier for these valiant scouts.\n\nI reached the moors that surround the hidden entrance to Rivendell. I found my way into the valley protected by the power of Elrond \nHalf-Elven. I quickly reached the entrance to the Last Homely Home and sought out Elrond. He received the letter and asked me to \njoin him as he read the report sent to him by his scouts. It turned out to be important information as to the movement of orkish\ntroops in the neighbouring lands. Grateful for the my willingness to face the dangers that carrying this message entailed, Elrond \nproceeded to reward me generously.",
    "walkthrough": "Upon entering their hidden camp, they may start talking - nod when they ask if you are willing to help, and they will give you a \nletter. Take this letter to Elrond, who will reward you. The amount of experience you receive will get smaller each time you complete \nthis quest. \nTarkhnarb orcs can kill scouts and bring letter to Great Goblin. Reward: 2,5k xp, 3 gold.\n \n<b>Reward:</b>\nxp and either 5 gold, or 2 gold + miruvor.",
    "reward": "xp and either 5 gold, or 2 gold + miruvor.",
    "achievement": "You delivered to Elrond a letter from his scouts with important information about the movements of orc forces.\nYou intercepted an important letter for Elrond from his scouts and delivered it to the Great Goblin."
  },
  {
    "zone": "Eriador",
    "quest_name": "The Elven weaver",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "s, 2w, 6s, w, 3s from 'Bridge before Grey Havens', Airy House",
    "objective": "Find out why the weaver's shipments of dye stopped",
    "description": "I encountered an extremely old elven weaver a short distance south of Harlond, who lamented of the fact that she had stopped \nreceiving her regular shipments of a very special dye. Without it, she is no longer able to produce the cloth used in a certain \ntype of cloak that is reputed to make the wearer all but invisible in the woods. I assured her that I would immediately seek out\nthe dwarf who normally supplied her dye to determine the cause of the problem.\n\nI managed to locate the dwarven dye-maker who crafts the special dye for the weaver. Further, I was intrumental in assisting him \nto retrieve a certain key ingredient for the mixture. He provided me with a generous supply of the newly brewed dye, which I \npromptly delivered to the weaver. She thanked me profusely for my assistance, as well as gifting me with a few small tokens of \nher esteem.",
    "walkthrough": "The ancient weaver will ask if you would help her, say 'yes'. Then she will send you to retrieve dye from a small mine up north \nnear the levee area. Find the dwarven dye-maker and say 'dye', if he asks you if you were sent by that old biddy who makes those \ngreen cloaks say 'yes'. Complete quest 'A handful of moss' to get the dye. Bring it back to the ancient weaver.",
    "reward": "2 gold, shiny dagger, 2000 xp",
    "achievement": "You fetched a jug of dye, formula no. 58 (forest green), to an elven weaver."
  },
  {
    "zone": "Eriador",
    "quest_name": "Equipping Leonard",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Black Hill Village, Simple Home",
    "objective": "Help young Leonard prepare for his future adventures",
    "description": "West of the path through the Black Hill village stands a simple home where I met a young man named Leonard. He was daydreaming of\nadventures in lands far away! Leonard asked if I could help him find equipment that would aid him in his future adventures. \nLeonard offered to share his knowledge he learned from rangers, hunters, and warriors within the village if I aided him.\n\nI wrote down the items he wanted, so that I can scratch them from my list as I deliver them to Leonard...\n\nThe young man was so excited when I brought him the items he needed that he exchanged notes of his knowledge with me. Leonard was \nall set for his adventure and I feel that I learnt a lot that will be useful to me!",
    "walkthrough": "Leonard wants your help to gather some equipment for his adventures. If you agree to help he will give u a list of items that he\nneeds. Some can be found nearby but you can also buy them from shop.",
    "reward": "Leonard's notes, 1000 xp",
    "achievement": "You aided Leonard in following his dream to become an adventurer."
  },
  {
    "zone": "Eriador",
    "quest_name": "Filatior's troubles",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Grey Havens cleric guild, Small Temple",
    "objective": "Seek evidence of evil from the Harlond burial mound",
    "description": "I found a slender elf named Filatior performing sacred ceremonies in the Small Temple within Harlond. He told me a frightening \ntale of a burial mound near the city where the dead had awoken and were seeking to harm the living. He asked if I could seek out\nthis grave for him, and bring me some part of the evil that lurks there. I accepted this task and set out to find this evidence, \npreferably a bone somewhere close to the heart, and return it to him.\n\nFilatior mentioned that the burial mound could be found east of the city by leaving out of the eastern gates and heading north. \nAs soon as I had left the road, I needed to turn to the east and travel past a burned-out area in the fields. I was then to \ncontinue into a swamp and look for a desolate area in the plains several leagues to the northeast. Moving south through some \nboulders I could then find the burial mound to the east.\n\nI found the burial mound and retrieved an bone as evidence for Filator. The acolyte did what he could to drive out the foul magic; \ncausing the bone to glow red and crumble into a grey dust. This task left him exhasuted and he lamented being unable to find the \nsource of the evil spell. He then rewarded me with a magical weapon left by an old warrior and cast a spell on my to aid me on my\ntravels.",
    "walkthrough": "Filatior the elven cleric of Harlond is seeking help to kill an evil being in a burial mound east of GH. After agreeing to the \nquest, he will describe the path to this burial mound. Follow the instructions, it is fairly easy (n 6e 5n 2e 2s e from Bridge \nbefore Grey Havens), kill the skeletons and bring back the rib-bone to him.",
    "reward": "7000 xp, blessing or str, random weapon (enchanted), +sindarin",
    "achievement": "You have helped Filatior to destroy evil beings."
  },
  {
    "zone": "Eriador",
    "quest_name": "Furs and skins",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Bree, Tanner's Workshop",
    "objective": "Collect the furs and skins for the Bree tanner",
    "description": "I visited a tanner in Bree, and he told me of his desire to create a special cloak with a silvery streak. He learned the pattern\nfor this cloak during his travels when he visited Elves out east. His last hunter, Darb, succumbed to a rattlesnake bite and died,\nand the tanner sought a brave adventurer to acquire the necessary pelts in Darb's stead. He promised to reward me should I succeed.\n\nThe master tanner was very pleased to receive the necessary pelts for his new pattern, and gifted me a cloak with with a silvery \nstreak. He told me he may need my services again, and to check with him in the future.",
    "walkthrough": "Give fur or pelts to the tanner for money rewards. Do not sell them. However, he also acts as a fur and pelt shop so you can sell\nfurs and pelts there, but it does not count as progress for the quest line. You need to give the pelts and furs instead. You can \nbuy the furs or pelts and turn them in as well. He doesn't care how you get the furs, as long as you turn them in. This is a chain\nquest: 2 brown bear furs, then 2 warg furs, then 1 rattlesnake skin, then (lev21) 1 Shire packleader fur.",
    "reward": "3 gold, brown bottle, a fur-cloak with a silvery streak. 4000 xp.",
    "achievement": "You assisted the Bree tanner in creating a fur cloak with a silvery streak."
  },
  {
    "zone": "Eriador",
    "quest_name": "Grimy business",
    "target_player": "Hill Troll",
    "repeatable": false,
    "location": "Warrens, Grimy Little Burrow",
    "objective": "Bring things to the grimy hill troll to learn to burrow",
    "description": "Under the Warrens, in a grimy little burrow, I found a hill troll who called me a nitwit. He offered to teach me how to burrow in \nreturn for bringing him some foodstuff.\n\nI have brought a shovel, the corpse of a Stoor child, the corpse of a lones-hare, and the corpse of a large rabbit.\n\nThe grimy hill troll ate all the corpses and broke the shovel. He taught me all the fine arts of burrowing, including making a \nhidden door!",
    "walkthrough": "Only hill trolls can take this quest to learn burrow skill. Burrow skill allowes hill trolls to dig burrow in hills, that makes \none safe room with hidden exit. To learn it, bring shovel, a Stoor child corpse, the corpse of a lones-hare, and the corpse of \na large rabbit to the grimy hill troll in Warrens.",
    "reward": "burrow skill",
    "achievement": "You entered a hastily hollowed-out burrow that was carved from a hillside."
  },
  {
    "zone": "Eriador",
    "quest_name": "A handful of moss",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "n of Grey Havens, Dyemaker's Alcove",
    "objective": "Locate a rare moss and return with it",
    "description": "While attempting to procure a rare dye to satisfy the needs of an elven weaver, I sought out a dwarf reputed to be capable to \ncrafting any dye imaginable. Alas, when I finally located him, he revealed that he was missing one key ingredient to produce the\ndye in question, a rare species of dark-green moss. Furthermore, he insisted that he was no longer able to secure more of it, due\nto a collapsed bridge. I volunteered at once to restock his supply, whereupon he directed me to proceed west to the river. There \nI am to search out a stump to which I can tie a stout rope. By throwing the rope over a branch on the far side, he claims that I \nwill be able to affect a crossing.\n\nI was successful in crossing the treacherous river and managed to locate a small supply of the moss. With it in my possession, \nI returned to the dye-maker. He quickly brewed up a noxious concoction that he insisted was precisely the right shade of green \ndesired by the elven weaver. He supplied me with a large jug full of the mixture, along with his heartfelt thanks for my efforts.",
    "walkthrough": "The dye-maker wants you to retrieve a small patch of dark-green moss. You will need a rope to get that moss. One loads in the \ncabinet n e from the dye-maker. Go to 'Cliff's Edge' at the river west from the mines. 'tie rope tree' and then 'throw rope stump' \nuntil the rope successfully catches the stump. wwn is the moss, take it and bring it to the dye-maker.",
    "reward": "1000 xp, 1 gold and a sealed jug of dye",
    "achievement": "You fetched some dark-green moss to a dwarven dye-maker."
  },
  {
    "zone": "Eriador",
    "quest_name": "Illusionist's sister",
    "target_player": "BN",
    "repeatable": false,
    "location": "ABR, Leader's Bedroom; Tharbad, The Illusionist's Laboratory",
    "objective": "Bring Osbert's head to the Illusionist of Tharbad",
    "description": "The Illusionist in Tharbad offered me a reward if I could kill Osbert the chief smuggler, and bring his head to her. Osbert had \nkilled her twin sister and now she wanted him dead.\n\nShe did not know where Osbert lives but it was somewhere to the east.\n\nI killed Osbert the chief smuggler easily and brought back his head to the Illusionist. The Illusionist was overjoyed with her \nsister being avenged, and was clearly impressed by my powers, as rewarded me with precious items.",
    "walkthrough": "Kill Osbert in the Bandits Camp in the middle of ABR, butcher him and bring his head to the Illusionist in Tharbad.",
    "reward": "small black opal, bolts (chanted)",
    "achievement": "You killed Osbert and avenged the sister of the Illusionist of Tharbad."
  },
  {
    "zone": "Eriador",
    "quest_name": "Key hunt in Tharbad",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Tharbad, Humble Workshop",
    "objective": "Find a lost key in Tharbad",
    "description": "I was interested in mastering a set of skills that are rarely taught openly. I heard rumours that led me to the city of Tharbad \nin search of more learned masters. Once there I was pointed in the direction of an old gentleman who was known by some to teach\nthese skills.\n\nAs I entered his abode, in the rooftops of Tharbad, he glanced my way and maybe he took to liking me, maybe he was testing me. \nHe told me a story about his exploits near the city gates, and of a key he lost that opened a warehouse there. He suggested I \nmight be capable of finding the key, and if I did so, I was welcome to use it and keep whatever was in the warehouse.\n\nI methodically searched the area around the western gate of Tharbad, even exposing myself at times to the foul waters of the \nGreyflood that turn toxic as they run through the city. Eventually I found a tiny copper key. Taking courage I braved the foul \nwaters and entered the warehouse. In there I found a small treasure, which I figured I had earned for my troubles.",
    "walkthrough": "The old man (guildmaster) will ask you to find a key for him. The key is hidden: From where the coach arrives in Tharbad, go all\nsouth, 2 east, open crack, north, 'reveal key'. The old man will have told you that this key was for a warehouse on the southern \nbank of the river, inside the city; he says that he doesn't want to be bothered with this any more, and that if you find the key,\nyou should use it.",
    "reward": "2 gold",
    "achievement": "Following the thief's advice, you found the lost key in Tharbad, and managed to enter to the attic above the warehouse."
  },
  {
    "zone": "Eriador",
    "quest_name": "Letter for Tethel",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Lorien, Tethel's Flet",
    "objective": "Bring Quenaire's letter of introduction to Tethel",
    "description": "After returning the missing book to Quenairė, he become so happy that he promised to write me a letter of recommendation, to be \ndelivered to a ranger named Tethel who lived in the outskirts of the Golden Wood. All I needed to do was to ask for the letter \nfrom Quenairė.\n\nI delivered the letter of recommendation to Tethel. She said that Quenairė's trust speaks highly of me, and let me understand that \nif I wasn't already familiar with the ways of the Golden Wood, she'd help me to visit Lórien.",
    "walkthrough": "After completing quest 'Quenaire's tome' you received letter for Tethel. Bring it back to Tethel, she will say that she has to \nspeak to Galadriel and vanish for 24 ticks. Return after 24 ticks and you will be granted limited access to Lorien.",
    "reward": "lembas wafers, possibly some miruvor, and a letter of introduction to the elves of Lorien.",
    "achievement": "You have been granted an annual entrance to Lorien."
  },
  {
    "zone": "Eriador",
    "quest_name": "Libram of Curaen",
    "target_player": "Anyone",
    "repeatable": false,
    "location": "Dead Knight area",
    "objective": "Navigate the glass maze under the Tower of Amon Sul",
    "description": "I found a thick tome titled the Libram of Curaen that was authored by a sage of Arthedain in the year 1311 of the Third Age. The\nlibram talked about a palantķr and a glass maze that was constructed beneath the Tower of Amon Sūl. I read that a map through the\nmaze could be stimulated subconciously by reading an example on the following page.\n\nThe instructions were to start below the Great Hall. I was then to move \"dirs\". I would then be on the path.\n\nI found my way down under the Tower of Amon Sūl and successfully navigated my way through the glass maze below the Great Hall.",
    "walkthrough": "As Whitie, to get the book you need to kill the Necromancer; Darkies can kill him too or complete the 'Berries for Karōlck' quest.\nTo read, hold the book and type \"read example\". The book gives you 14 dir for the glass maze and the directions are individual.",
    "reward": "Quest itself doesnt have direct reward but passing maze leads area where Palantir loads.",
    "achievement": "You navigated through the glass maze as described by the Libram of Curaen."
  },
  {
    "zone": "Eriador",
    "quest_name": "The lonely Giant",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Shire",
    "objective": "The giant will teach you his baking secrets",
    "description": "I met with a giant and comforted him as he seemed lonely. To my joy he said we could be friends if together we could go in search\nof some fresh ingredients for his baking that he so much enjoys. \n\nWe travelled far and wide looking for lots of unusual herbs and spices. Finally, when we had found everything we needed, he called\nme <name>-the-winkle and we were firm friends.\n\nHe let me ride him to his home in the hills - what a journey that was... Once there we learned how to make bannocks together, I \nwrote the recipe in my herblore journal to remember it, they were delicious!",
    "walkthrough": "Possible load places in the Shire: one room N from Michel Delving fountain; E from Green Dragon in Hobbiton; N from the marketplace\nin Dwaling; in Rushey; at \"slight depression\" (up from the fox hole); NW from Wittforrows and in the Hills of Scary. If you can't\nfind the giant - ask any mage to locate him ('locate life' spell). He doesn't always load.\n\n  Quest: You must find a lot of herbs and other things and bring them to him. He frequently asks for:\n\n  HONEYCOMB           EGG                 APPLE               SACK OF FLOUR\n  STRAWBERRIES        BLUEBERRIES         BLACKBERRIES        BLACKCURRANT\n  CINNAMON            VANILLA BEAN        CARDAMOM            JUNIPER BERRIES\n  RED ROSE            WHITE ROSE          WATER LILY          HONEYSUCKLE\n  FOXGLOVE            FOXTAIL             TARRAGON            THYME\n  ROSEMARY            GOOSEGRASS          CLOVER              CLOVES\n  SAGE                ATHELAS             MARJORAM            FIGWORT\n  GINSENG             COMFREY\n\nTry to find all these things, but if you can't find such rare herbs as foxtail, ginseng and comfrey, don't worry, maybe he won't\nask you for them. Do not crush the plants: sometimes he asks for leaves/flowers, sometimes for the plant itself. When you find \nthegiant, comfort him. Nod after he asks you if you want to help him, and he will start following you. Give him honeycomb, listen \ncarefully what he wants and give him herbs. You have a short time to solve his quest - 40-48 MUME hours, so try to have some herbs\nready in your backpack - except for things that are always available in the GH herbalist shop (cinnamon, cloves, vanilla). You can\nrun to GH with the giant, but he can become moveless soon - in such a case leave him in some safe place (just flee from him), and\nreturn with herbs. After giving him all that he wants, ride him and he takes you to his house near Michel Delving and be happy\nlistening to him.\nThis quest is as level-dependant - so if you find him at level 1-5, he will teach you how to cook bannocks just for the honeycomb! \nLegends can be asked for ginseng, comfrey and foxtail - each of these herbs load just in a few places on Arda, so it is almost \nimpossible to find them without knowing where they load.",
    "reward": "Baker herblore, 1000 xp for every herb he asks",
    "achievement": "You befriended the lonely giant and visited his home in the Hills of Faraway.\n  </name>"
  },
  {
    "zone": "Eriador",
    "quest_name": "The lost dagger",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Bree, Weapon shop",
    "objective": "Help the weaponsmith in Bree recover his lost dagger",
    "description": "As a collector of antique weapons the Bree Weaponsmith was very excited to receive news that a friend of his has found him a \nparticularly old and rare dagger. However, when I passed his shop he told me it still hadn't arrived despite it having left \nFornost many weeks ago. Clearly something had happened to the messenger and I agreed to help out by going looking for the missing\nantique blade. He told me to start looking at the Nasty Mewlip Inn where the courier often stopped for a drink.\n\nThe ruffian Scarred had the missing dagger in his possession! He and his band of men put up a fight but eventually they were \ndefeated. I grabbed the dagger and returned to Bree where the grateful Weaponsmith gave me my reward.",
    "walkthrough": "You will be asked to find and bring the \"valuable\" rusted dagger - just enter the shop at the proper level. This dagger is held \nby the chief of the ruffians, Scarred, under the bark in a forest some n of Bree. Kill him (or just ask a friend to kill him) and\nbring the dagger to the smith. You cannot start the quest after level 9, but if you did it before and leveled since then, the smith \nstill gives the reward if you bring him the dagger. Or, if you bring the dagger to the smith without being on the quest (if you \ndo this quest second time and/or after level 9), the smith gives you as a reward stone and gold only. The dagger is no-rent/sell.",
    "reward": "Whetstone, 2 gold, 2000 xp.",
    "achievement": "You recovered the antique dagger sought by the Bree weaponsmith."
  },
  {
    "zone": "Eriador",
    "quest_name": "Lost daughter",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Hobbiton, Heldor's Clothes Emporium (2e s from central).",
    "objective": "Find and return a lost daughter to her worried father",
    "description": "The poor shopkeeper is in a dilemma. His daughter has gone missing and he wants to search for her, but what if she came home while\nhe was out looking? The only solution is that I go and look for him. I've been told that she doesn't wander all that far so I had \nbetter keep to the Shire.\n\nI returned the shopkeeper's daughter to her father safe and well. He was very relieved to see her again and the daughter seemed \nhappy to be home. Having spoken to her as we travelled she is a very strong-willed young woman and, knowing what she is like, she \nwill undoubtedly go 'exploring' again!",
    "walkthrough": "Shopkeeper will ask you to find his daughter as soon as you enter his shop. Daughter is usually located somewhere in the Shire, \npossible five locations:\n-From 'A Spring' in hills of Scary: 2e, open branches, s, 4e, n, w\n-From Brandywine Bridge: 7w, 6n, 5e, open exit e, e\n-some down from Michel Delving\n-From Brandywine Bridge: e, 2s, 2e\n-From Tuckborough Market Square: d, w, 2n, open exit d, d \nJust enter her room and she will start following you. Lead her to her father.",
    "reward": "forest green cloak, 1000 xp, 1 gold.",
    "achievement": "You found the lost daughter of a Shire shopkeeper and brought her home safely."
  },
  {
    "zone": "Eriador",
    "quest_name": "Lost ring recovery",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Black Hill Village, Low Stone Cabin",
    "objective": "Search for a lost wedding ring in the Tower Hills",
    "description": "After returning to the crippled ranger with Lum's moneybag, he told me another story about Lum's cousin Clem. It appears they \nbelong to a family notoriously incapable of holding on to their belongings. And since I had been so helpful to Lum, the ranger\nthought that maybe I could help poor Clem too...\n\nThe crippled ranger explained how Clem had been deep in a cave, gathering mushrooms, when he lost his wedding ring. The wedding \nring means a great deal to Clem, as his wife is no longer among the living, and Clem would be grateful to have the ring returned \nto him.\n\nThe ranger's knowledge of the way to the cave was clear as day! I was to follow the wagon trail to the south-west, and the valley\nlies just on the western side of the trail, a few miles before it merges with the worn trail further south. Clem lost the ring on \nthe other side of an underground lake, and I will have to search for the ring in the right place.\n\nMaking my way to the tunnel was easy, but once inside I realized how deep underground it went. Deeper within the tunnel was an \nintersection, and from this point one could smell the humidity in the air from the western tunnel. Following the damp and humid \nair deeper into the western tunnel led me to a lake. It was a good thing I knew I had to make my way across it, or I would never \nhave tried it.\n\nI will never forget the chill of the water and the gloomy stalactites threatening above! Once I reached the cavern beyond, I could \ninstantly tell this was an old meeting place from the litter scattered about the ground. After looking through some of the old \nlitter, I began searching around in the dirt. When digging into the ground at a slight impression, my nails and hands covered in \ndirt, I suddenly felt something solid and cold. The ring! Dusting the ring off with the sleeve of my shirt, I slipped it into \nmypocket for safekeeping, and headed back to the village.\n\nThe crippled ranger was excited for my return with Clem's old wedding ring and was kind enough to give me a moneybag, a plain \nscarf, and a gold coin to aid in my adventures.",
    "walkthrough": "After completing quest 'Moneybag recovery' ranger will asks you to help him again, after nodding you need to get Lum's cousin \nClem lost old wedding ring. Its located near Way Station, go ennwssswsw and 'search ring'. Bring it back to ranger for rewards.",
    "reward": "Moneybag, plain scarf, 1 gold, 1000 xp",
    "achievement": "You swam in murky water."
  },
  {
    "zone": "Eriador",
    "quest_name": "Maelton's work",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Black Hill Village, Black Hill Market Square",
    "objective": "Maelton will direct me to quests in the Tower Hills",
    "description": "I found Maelton in the Tower Hills acting as a middleman directing adventurers like myself to villagers in need. He told me to \nseek him out if I ever needed more work around Black Hill Village.\n\nMaelton told me that I had done great work in Black Hill Village and that it was time for me to seek adventures elsewhere. He \ngave me a letter of recommendation and told me to deliver it to his cousin who worked in Bree. In order to reach Bree, I had to \nfollow the Road to the Grey Havens east past the Shire until I reached where the Old East Road met the Greenway. Maelton said\nthat his cousin worked in Bree as a secretary.\n\nI travelled all the way to Bree and found Maelton's cousin. I handed in the letter of recommendation and closed the chapter of \nmy story around Black Hill Village.",
    "walkthrough": "Upon entering Maelton, the village elder he asks if you will listen to him, say 'yes' and he will tell you how you can come to \nhim and ask about help and quests. After finishing all Tower Hills quests, approach Maelton again and he will offer a small favor \nand thank you for your help. Say 'yes' and Maelton will hand you over a letter of recommendation. You should bring this letter \nto the secretary in Bree.\n \n<b>Reward:</b>\nBree citizenship; hug if you have it",
    "reward": "Bree citizenship; hug if you have it",
    "achievement": "You travelled all the way to Bree and found Maelton's cousin."
  },
  {
    "zone": "Eriador",
    "quest_name": "Mangy bear cull",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Bree, Archery Range",
    "objective": "Put a mangy bear near Fornost out of its misery",
    "description": "Beriagon, a hunter based in Bree, has asked me to take down a diseased and dangerous bear, one that has an injured leg from a failed \ntrap attempt, and a bad case of mange. The great beast has caused massive damage to barns and livestock, and is unlikely to be able \nto hunt naturally, due to its injury. He advised me that it has been spotted far north of Bree, and might be found in the vicinity \nof a camp site, or a place with human food and detritus.\n\nBeriagon was delighted to hear that I had successfully put down the mangy bear, and assured me that the farmers of Bree-land would \nhear of my brave exploits.",
    "walkthrough": "Beriagon the hunter asks you to kill the mangy bear. The mangy bear loads north of Fornost. As you kill it, this quest automatically \nreports it back to the quest giver for you. You need to return back to the Beriagon to get the next step in the quest chain and say \n'yes' if he asks if you are willing to continue.",
    "reward": "5000 xp",
    "achievement": "You aided the Bree-land by killing a wounded, and dangerous bear."
  },
  {
    "zone": "Eriador",
    "quest_name": "Mining for ore",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Black Hill Village, Blacksmith's Backyard",
    "objective": "Bring the apprentice ore to finish his work",
    "description": "After arriving in Black Hill village, I spotted and approached a well for a much-needed drink. Working nearby, a blacksmith's \napprentice approached, pleading for help retrieving ore from a nearby mine. I considered the benefitsof befriending a craftsman \nof his trade. He instructed to wield a pick and mine where the mineral veins show the most, and pointed a finger south-east, \nsaying, \"The mine in mind is just over yonder!\"\n\nActually I think he was a bit more clear than that, now that I think back to the encounter. East along the trail outside the \nvillage's south gate, I'll find a Hunter's cabin. The mine is close by the cabin, just to the south-east. I need to mine some ore.\n\nAfter a short venture, I came across the mine and, pick in hand, I went to work! It was a slightly laborious effort, but before \nlong I had the ore in hand. The young apprentice was gladdened to have the materials he needed, and rewarded me with a sturdy \nbackpack to help me carry my possessions. Lastly, he informed me that his master would happily give me coin for any ore I sell \nat the smithy in the future!",
    "walkthrough": "Apprentice needs your help with ore mining. Nod or say yes when he asks for your help. He asks you to bring him ore from the old \nmine just some se from Black Hill Village. He will give you a pick, a lantern and oil. Mine the ore and bring it back to him.\n \n<b>Reward:</b>\nleather backpack, 1000 xp",
    "reward": "leather backpack, 1000 xp",
    "achievement": "You aided the blacksmith's apprentice in Black Hill village by bringing him ore."
  },
  {
    "zone": "Eriador",
    "quest_name": "Moneybag recovery",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Black Hill Village, Low Stone Cabin",
    "objective": "Search for a lost moneybag in the dry gulch",
    "description": "At the north side of Black Hill village in the Tower Hills, I met a crippled ranger who was happy to teach me his knowledge of \nthe wilderness. The crippled ranger then told a sad tale of Old Lum, an elder of the village, who lost an old moneybag with \nsentimental value while he was gathering berries and roots at the edge of a cliff.\n\nAfter listening closely to the crippled ranger's tale of Old Lum, I decided to be of service to the crippled ranger and seek to \nretrieve it for Old Lum. The moneybag had fallen off the cliff onto a ledge in a dry gulch, just west of an old tower that stands\nin the hills to the south of the village. The ranger said I would probably have to get to the ledge from the bottom of the gulch, \nand that he could teach me the climbing skill, which would likely be needed.\n\nOnce I find the ledge, I will have to search for the moneybag.\n\nThe well-travelled wagon trail took me along rolling hills covered with wildflowers and grasses, until I came upon hills so barren\nthat even a weed would have a tough time surviving. It was here that I came upon the dry gulch.\n\nAfter climbing down a rocky slope toward a dry gulch, I discovered I was going to need more than just wilderness skills here. The \ngulch was infested with snakes! I made it past them and found myself at the bottom of the gulch, below the ledge where the moneybag\nlanded. My hands and legs were exhausted from the climb, but it was here that I recovered Old Lum's moneybag and promptly returned \nit to the crippled ranger at Black Hill village.",
    "walkthrough": "As you enter crippled ranger house, he will ask your help, nod and again if he asks second time. He wants you to retrive Old Lum's\nold moneybag that is lost in the hills. Reach to On a Rocky Shelf and 'search moneybag'. Bring it back to ranger.",
    "reward": "",
    "achievement": "You climbed to high heights."
  },
  {
    "zone": "Eriador",
    "quest_name": "The plump hobbit",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Shire; Hobbiton, A Comfortable Smial",
    "objective": "Help the plump hobbit win top baker at the festival",
    "description": "I ran into a rather plump hobbit female that wanted to win the top baker prize at the local festival within Hobbiton. She gushed\nabout a particular meat-pie like treat she got from her cousin the tanner in the Woody End Forest. She promised a reward if I were\nto bring back more of these savoury treats.\n\nI was pulled into a journey that involved meeting a tanner and venturing into Bree to acquire some savoury dumplings from the \nlocal baker. I returned to the plump hobbit with the delectable treats and she promptly ate them trying to decipher the recipe. \nShe rewarded my efforts with a ticket for a dales-pony from the famous Dwaling stables.",
    "walkthrough": "A plump hobbit female in the A Comfortable Smial in Hobbiton will ask you to bring treats. Complete the Bree baker questand bring\nher the dumplings you receive as a reward.",
    "reward": "2000 xp for 4 dumplings, a map of the freehold of the Shire, dales-pony ticket.",
    "achievement": "You got a pony for helping the plump hobbit learn how to bake dumplings."
  },
  {
    "zone": "Eriador",
    "quest_name": "Ponybreeder's plight",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Tower Hills, Home of a Pony Breeder",
    "objective": "A ponybreeder in the Tower Hills needs aid with a wolf",
    "description": "Whilst venturing through the Tower Hills, I happened across the humble abode of an old pony breeder. Despite a warm welcome, his \nexpression belied troubled thoughts, and soon he made his plight known: his prized ponies had been falling prey to a particular \nold, one-eyed wolf. He surmised the beast, addled from long years of predatory life, has permanently fixed its eye upon the \ncorralled ponies for an easy meal, and will not stop feeding upon them unless it is slain. He offered what he knew of the wolf: \nfirst, the tracks always lead to and from the east, and the best way to lure out such a beast was to lay fresh animal meat near \nits den.\n\nFollowing what the old pony breeder said of the wolf, I quickly picked up its tracks not far to the east of the pony corral. \nFollowing it further, the tracks became more pronounced; it was time to find the bait. After hunting down some suitable prey and \nbutchering it, I made my way to the forest. I found the den shortly after and dropped the meat nearby, retreating a short distance \nbehind some brush. Within minutes the beast emerged, salivating from the scent of fresh meat. I quickly learned how ferocious an \nold wolf can be, even in his old age! Luckily, I was able to dispatch the terror and brought its hide back to the pony breeder, \nwhom was finally able to rest easy knowing his ponies were now safe.",
    "walkthrough": "As you enter the home of the Pony Breeder, he will start talking about his problem. If he asks if you have a little time to spare,\nnod. Then you need to nod again after he asks if you will help him. After that he needs you to get some fresh meat and lure out \nthe old wolf. Kill some random animal nearby, butcher and drop the meat sseeenen from the House of Pony Breeder. After the old \nwolf appears, kill him and butcher him for fur. Take the fur to the Pony Breeder to receive rewards.",
    "reward": "woollen traveller's cloak, leather saddle, 2 large piece of smoked, cured meat, 1 gold, 2000 xp",
    "achievement": "You helped the pony breeder in the Tower Hills with his wolf problem."
  },
  {
    "zone": "Eriador",
    "quest_name": "Pork and venison",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Bree, Brightly Lit Bakery",
    "objective": "Bring raw meat to the Bree baker",
    "description": "The baker in Bree was injured while hunting for fresh meat. He needs pork and venison to make his special meat pies, but is unable\nto hunt for it himself. He asked me to bring him pork and venison so that he could continue making meat pies.\n\nThe baker was very grateful that I was able to bring him the meat he needed and in return, he rewarded me with a new dumpling that \nhe is working on, that is not even for sale yet.",
    "walkthrough": "Say 'yes' after hobbit baker ask if you are interested lending him a hand. Bring him 10 pounds of venison meat and 10 \npounds of pork meat. He will keep track of your progress as you turn meat in. Make sure it's raw meat.",
    "reward": "4 savoury baked dumpling, 1 silver, 3000 xp",
    "achievement": "You have helped the baker in Bree by delivering him meat for his meat pies."
  },
  {
    "zone": "Eriador",
    "quest_name": "Ragged hobbit rescue",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Warrens, Food Storage",
    "objective": "Rescue the ragged-looking hobbit from the Troll Warrens",
    "description": "On my travels I discovered a ragged-looking Stoor within the foul depths of the Troll Warrens. He initially panicked when he saw \nme but quickly regained his composure only to nearly give away our position by expressing his joy. We then proceeded to escape \nfrom the deep pit.\n\nAfter we escaped from the Warrens he thanked me and asked me if I could bring him to a Stoor village to the southwest.\n\nI found the village and the ragged-looking hobbit fell to the ground in tears, kissing the earth repeatedly. He then entered his\nhobbit hole and returned with some gifts, rewarding me for helping him escape.",
    "walkthrough": "Open the pendoor (24 str needed) in the Warrens or bash the stonedoor and let the hobbit inside follow you. Bring him to the Stoor\nvillage some west of Windswept.",
    "reward": "5 gold, honey-scented cake, amethyst, fishing rod and small jewel-box.",
    "achievement": "You rescued a Stoor hobbit from the slave pit in the troll warrens and helped him get home."
  },
  {
    "zone": "Eriador",
    "quest_name": "Rat infestation",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Tower Hills, Hunter's Cabin",
    "objective": "Exterminate giant rats in the Tower Hills",
    "description": "Once I returned to the accomplished hunter, he set forth upon me a secondtasking, clearly seeing my potential. He instructed me \nto head north-west to Black Hill Village, then follow the path north out of the village until I came to the farming fields. From\nthere I would head straight west until I reached the farm that had a barn with a cellar hatch. I was to search down there for the\nsource of giant rat infestation!\n\nThe hunter made it quite clear that I would need the search skill he could teach me if I was to find the locations of the giant \nrats. Perhaps I should be looking in all directions down there to see if anything looks odd about the walls. Three corpses, I \nbelieve should be enough to show proof that my task was done well.\n\nFollowing his directions, I came across the farm quite easily. Once down in the hatch, I saw the rats skittering into holes in \nthe wall, and promptly searched in those directions. I skilfully uncovered hidden doors that lead me to them, and dispatched them \nall! I brought the corpses back to the accomplished hunter and he rewarded me with a nice pair of boots.",
    "walkthrough": "After completing quest 'Snake hunt', the hunter will ask you to slay rats, nod when asked. Head n through village and there's a \ncellar in the farmhouse. Kill giant rats, take 3 corpses with you and give them to the ranger.",
    "reward": "fine pair of soft leather boots, 500 xp",
    "achievement": "You aided Black Hill village and the hunter by cleaning out a rat infestation."
  },
  {
    "zone": "Eriador",
    "quest_name": "Scarred boar hunt",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Bree, Archery Range",
    "objective": "Kill a scarred boar that has been plaguing Bree-land",
    "description": "Beriagon, the hunter in Bree, has tasked me with killing  a troublesome boar that has plagued many merchants who bring goods to \nand from the city. He advised me to search wooded areas, closeby and north of Bree, for a boar with large tusks, an agressive \nnature, and scarred skin. He also advised me to bring a group, lest this beast get the best of me!\n\nWith the task of putting down the troublesome boar completed, Beriagon thanked me, and was sure that the merchants that pass \nthrough town would be thrilled to hear about it.",
    "walkthrough": "After Beriagon the hunter talks, 'ask hunter beast'. He wants you to kill a special scarred boar. The boar is NE of Bree, in a \nforest with bats, near the entrance to Scarred. As you kill it, this quest automatically reports it back to the quest giver for \nyou. You need to return back to the Beriagon to get the next step in the quest chain and say 'yes' if he asks if you are willing \nto continue.",
    "reward": "1000xp",
    "achievement": "You helped the Bree-land by putting down a troublesome boar."
  },
  {
    "zone": "Eriador",
    "quest_name": "Shire wolfpack",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Michel Delving, The Mayor's Office",
    "objective": "Bring a great pelt to the secretary of Michael Delving",
    "description": "I received an urgent request from the Mayor of the Shire, who sought assistance in dealing with an impending threat from a wolfpack\nduring the upcoming winter. My task was to eliminate the wolves and retrieve a pelt from one of the great black wolves as evidence.\nUpon completion, I was to deliver the pelt to the secretary in Michael Delving.\n\nI bravely battled the mighty wolfpack during the fell winter and successfully obtained a pelt, which was presented as proof of\nmy triumph to the Mayor's office in the Shire.",
    "walkthrough": "You must kill the great wolf from the Shire wolfpack and bring his fur to the secretary in order to receive citizenship. The \nwolfpack repops each winter in Dwaling in the Shire, once per winter. Usually it consists of 4 pack leaders (great black wolves) \nand 18 grey/black/huge black/starving ones. Each person who needs citizenship needs their own silvery fur and also needs to have \nthe great black wolf in their trophy.",
    "reward": "Shire citizenship, 2 gold.",
    "achievement": "You battled the great black wolves during the fell winter."
  },
  {
    "zone": "Eriador",
    "quest_name": "Smith's delivery",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Black Hill Village, Blacksmith's Backyard",
    "objective": "Deliver a heavy bundle of iron rails to the miner",
    "description": "The blacksmith's apprentice in Black Hill asked me to deliver a bundle of iron rails to a working miner, close to town. The apprentice's\nusual deliveryman, Tad, was still recovering from a snake bite he received near town. To reach the miner, the apprentice told me \nto head south out of town, then turn west at the signpost, into the rolling hills. He told me a mine exists in the southwest corner \nof the hills, and that the miner would be found within it.\n\nI delivered the bundle to the miner. He was overjoyed to receive it, and said that he would use it to finish the cart rail in his \nmine. He paid me in silver for the delivery.",
    "walkthrough": "Apprentice needs your help again, this time he ask you to bring bundle of iron nails to miner. To carry bundle you need a mount, \nsince you will drop them if you want to carry themself. Mine is located some west-south from signpost before Black Hill village. \nHand over bundle to to get reward.\n \n<b>Reward:</b> \n10 silver, 750 xp",
    "reward": "10 silver, 750 xp",
    "achievement": "You delivered iron rails to a Black Hill miner, helping him complete his railing project."
  },
  {
    "zone": "Eriador",
    "quest_name": "Three flowers",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Black Hill Village, Pungent Herbal Store",
    "objective": "Gather three flowers for the herbalist in Black Hill",
    "description": "A herbalist in Black Hill village, in the northern part of the Tower Hills, persuaded me to aid him. A tale of sickness and a \ndesperate need for a remedy moved my heart. Three plants he asked me to bring, and I made sure to note down what he said of them;\n\nThe first is often called ragwort, which grows in clusters of bright yellow flowers on a many-branched stem. It can be found in\na marshy area well to the south. Travel due south. Look for it just east of the hills, and north of the road.\n\nThe second is known as hawkweed, which grows as a cluster of bright orange flowers on a single stem. It grows on tall hills, and \nseems to prefer stony ridges. It can be found here in the Tower Hills. The best place to search for it is on the rocky ridges \nsome south-west of the old tower between here and the road to Grey Havens.\n\nThe final flower is wood anemone, which is a very small but bright white flower with a yellow centre. I know it grows in one of \nthe forests on the nearby plains. Travel south and east, to the plains east of the old tower. There is a pony breeder there, and \nthe forest just east of his pasture is the one to search.\n\nI brought the herbalist the three plants he needed, and he was overjoyed. He gave me an item every traveller interested in potions \nand brews should have - a herbal kit.",
    "walkthrough": "Upon entering the herbalist's store he asks if you have time to listen to his plight, nod and nod a second time when hes asks if\nyou could help him. The herbalist looks for three very specific flowers in order to accomplish his cure. \nRagwort - Located in a marsh some south.\nHawkweed - Located at the Edge of a Barren Plateau near road to GH.\nAnemone - Located in a forest east of the Pony Breeder.\n \n<b>Reward:</b>\nherbal kit (no upgrades), random herb (cloves, athelas, bag of cinnamon)",
    "reward": "herbal kit (no upgrades), random herb (cloves, athelas, bag of cinnamon)",
    "achievement": "You aided the herbalist in Black Hill village by bringing him three rare plants."
  },
  {
    "zone": "Eriador",
    "quest_name": "Snake hunt",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Tower Hills, Hunter's Cabin",
    "objective": "Exterminate slithering snakes in the Tower Hills'",
    "description": "Whilst travelling across the Tower Hills, I came across a hunter whom, judging by his demeanor and willingness to teach me the \nfundamentals of scouting, seemed quite accomplished in this area. He eyed me evenly, perhaps sensing some potential within me that\nI had yet to realize, for suddenly he asked for my help: slithering snakes have been reproducing in alarming numbers, striking \nfrom the grasses and shrubs north of the trail just outside his hut. He encouraged me to return with three of their corpses; to \nnot do so, I felt, would be to miss out on more than one experience!\n\nI headed to the area on the other side of the trail, in search for these menacing, slithering menaces. It didn't take long before \nI found the slithering snakes, judging by their aggressive behavior, I think they might have seen me long before I saw them! It \nwas a heated exchange of blows, but before long I had three smelly snake corpses to bring back to the accomplished hunter. He\nrewarded me with a snakeskin belt to not only keep my trousers upon my waste, but to remind me that with effort and bravery, great \nrewards are to be had!",
    "walkthrough": "As you enter the Hunter's Cabin, the hunter will ask for your help, nod and then again when he asks if you are ready for snake \nhunting. Kill 3 snakes in the area just n of him. Take the corpses with you and give them to the hunter.",
    "reward": "snakeskin belt, water skin 200 xp",
    "achievement": "You aided the hunter in the Tower Hills with his slithering snake problem."
  },
  {
    "zone": "Eriador",
    "quest_name": "Traveller's brew",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Under the Dike, near Weathertop (from Nen-I-Sul bridge: 6w, 2n, open culvert, e)",
    "objective": "Prove my worth to the Dunadan ranger",
    "description": "I found a Dśnadan ranger near Weathertop who gave me a chance to learn the secret of a brew that would greatly help my travels. \nHe had heard stories of my conquests; but even so, did not trust me with the brew lest it fell into the hands of the enemy. He \nhad put together a test that would lead me into the forgotten parts of Arda and prove that I was worthy. I was instructed to take\nup this quest alone. If I took aid I would fail.\n\nI completed the ranger's test and he provided me with the secret recipe to make the traveller's brew. I recorded the recipe in my \nherblore journal should I ever forget it.",
    "walkthrough": "Ranger will teach his lore to well travelled and good aligned persons (\"sent to Arda\" is enough, \"firm believer\" doesn't fit) when\nthey complete his given task. The task involves three objects that must be brought to the ranger. The items may be different for \neach person, the following items are known as possible quest items.\n\n*White fur from the Huge White Bear.\n*A claw from a Cavern-wing.\n*The heart of the Ice-Demon.\n*A sickly green mushroom.\n\nYou must find these items alone (means: no same side player can be in the zone when you pick up these items). When you pick up an\nitem in question, no one can be in the zone, you should not be grouped, and you should not be following anyone. You need approximately \n2.8k*level tps. It isn't a real formula, though - but it works until level 27. After level 27 the formula is approximately 3.3k*level\ntps. Gather all items he asked and return to him alone to receive herblore. If you fail the quest (i.e. the ranger is dissatisfied \nwith the way you got the items), your slate is wiped clean in about one RL month.",
    "reward": "Travelling herblore.",
    "achievement": "You traveled far and wide to prove yourself worthy to the Dunadan ranger."
  },
  {
    "zone": "Eriador",
    "quest_name": "Wolf pack attack",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Bree, Archery Range",
    "objective": "Track down and cull a pack leader near Bree",
    "description": "Beriagon, a hunter who lives in Bree, has told me about a dangerous and cunning pack leader that prowls about halfway between Bree \nand Fornost. This wolf and its pack has caused major disruptions to the livelihoods of several farmers who depend on the income \ntheir livestock produce. Beriagon told me to seek out and slay this wolf, and to help bring prosperity again to the troubled \nlivestock industry of Bree-land. He told me that the wolf and his pack like to roam in, or near brushland, north of the city.\n\nBeriagon thanked me for tracking and hunting down the leader of the wolf pack, and told me he would inform the farmers of the area \nof my good deed.",
    "walkthrough": "Beriagon the hunter asks you to kill the menacing pack leader. The pack leader wolf loads in between Bree and Fornost, east of \nthe road in a forest with many wolves. As you kill it, this quest automatically reports it back to the quest giver for you. You \nneed to return back to the Beriagon to get the next step in the quest chain and say 'yes' if he asks if you are willing to continue.",
    "reward": "3000 xp",
    "achievement": "You sought out and killed the leader of a dangerous pack of wolves."
  },
  {
    "zone": "Eriador",
    "quest_name": "Woody End tanner",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Woody End Forest, south of Hobbition.",
    "objective": "Bring wolf and snake pelts to the Shire tanner",
    "description": "The Hobbit tanner that lives in the Woody End told me of the dangerous wolves and snakes that live in the nearby lands, and asked\nme to bring him some of their pelts. He said that slaying them would bring a semblance of peace to the land, and as a reward he \nwould make me some helpful leather from them.\n\nThe old tanner of the Woody End was very happy to receive pelts to make different kinds of leather for me.",
    "walkthrough": "The tanner in Woody End Forest will ask you to find a black wolf fur, a grey wolf fur, a white wolf fur, and a rattlesnake skin.\nFor every fur/skin you earn a new achievement. The items can be butchered by you, given to you, or purchased in a shop. There \ndoes not appear to be any timeline to finish the quest.",
    "reward": "black wolfskin wristband, grey wolfskin wristband, white wolfskin wristband, snakeskin belt, selling all the items is about 1 gold worth, 250 tps per item",
    "achievement": "You have done business with the old tanner of the Woody End.\nYou helped the old tanner of the Woody End create a piece of leather.\nYou helped the old tanner of the Woody End create two varieties of leather for a total of two pieces.\nYou helped the old tanner of the Woody End create three varieties of leather for a total of three pieces.\nYou helped the old tanner of the Woody End create four varieties of leather for a total of four pieces."
  },
  {
    "zone": "Fangorn",
    "quest_name": "Beechbone's bowl",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Eastern Fangorn, Pristine Wood",
    "objective": "Beechbone the Ent needs help with recovering a bowl",
    "description": "I was travelling through the mighty forest of Fangorn when I ran into one of the Ents that guard the trees. He seemed forlorn and \nI inquired as to the reason of his sadness. He told me how his beech trees had been overwhelmed by traitorous, evil birch trees. \nHe could not bring himself to go back to his home to recover the only item he left there that had meaning to him; his drinking bowl. \nI offered my assistance and he pointed me to his home, somewhat further south, in an area surrounded by birch trees that seemed to \nstrangle the life from all the vegetation surrouding them. He also warned me about the size of the utensils in his old home and \nsuggested I take a large branch to use as a lever to help me search around for his bowl.\n\nFollowing Beechbone's advice I managed to enter his old home. Once inside, and after some searching I finally found, underneath a \njar, his lost bowl.  When I got back to Beechbone he could not withhold his happiness, rewarding me with a rough, wooden horn. He \nalso shared with me its wondrous story starting with a song and then telling me of the days of friendship between the greenelves \nof Ossiriand and his people, the shepherds of trees.",
    "walkthrough": "Find Beechbone, he is the sad ent that lives in eastern Fangorn. Comfort him and ask him 'why sad'. After asking for your name he \nwill tell you his story. He will ask you to recover his bowl, once you agree with him go some w and south till you find the forest \nclearing. Make sure you get one of the very heavy branches that lie around Fangorn. You will need it to lift the jar under which \nyou will find his bowl. Exit south from clearing is stranglingbirch, go all south and then type 'lever jar, go down and reveal \nbowl and take it back to Beechbone. He will thank and reward you.",
    "reward": "rough wooden horn, +entish",
    "achievement": "You found and returned the lost bowl of Beechbone the Ent."
  },
  {
    "zone": "Fangorn",
    "quest_name": "A blight in Fangorn",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Fangorn",
    "objective": "Aid Treebeard in his quest to cleanse Fangorn",
    "description": "I was wandering through the northern parts of Fangorn forest when I found myself near a grove of mighty oak trees. Unlike most of \nthe areas in the forest, there seemed to be some evil at work; the trees were affected by some poison. I shared my concerns with \nold Treebeard who already knew of this and suspected some foul magic or worse was responsible for the blight I had observed. \nMoreover, not only did he claim that this magic was beyond him, but also expressed his sorrow at how we have slowlybecome less \nand less interested in all things natural. We seek to replace them with our own crafts - minds of metal, he called it. I left \nTreebeard's home determined to set things right and, if even for a little while, make Fangorn better for those who inhabit it.\n\nAs I explored further into the poisoned forest I found a burrow in the ground. It was surrounded by dark, poisonous roots that \nprevented anyone from entering. Noticing that simply killing them would block the entrance entirely, magic became the only possible \nsolution. Using healing magic aimed at neutralizing the effects of the poison eventually made the roots vanish, leaving the entrance \nexposed. Once inside a monstrous black spider appeared from the shadows. After a fierce battle, the creature lay slain. I figured \nI should take some part of the creature back to Treebeard's so that he may find an explanation to this. After carefully butchering \nthe corpse I managed to sever its chelicera.\n\nI gave the chelicera to Treebeard who was not only satisfied with the explanation this evidence provided, but was also happy that \nI had rid the forest of its effects. He invited me share one of the marvelous draughts made from water of the Entwash, a refreshing\nand marvelous reward!",
    "walkthrough": "Go to the Treebeard's hut and 'ask tree poison'. He will talk a bit about a part of the forest which is found in the eastern portion \nof fangorn (some north of Beechbone). Once you find the poisoned forest you need to deal with the roots, killing them is of no use \nsince they block the entrance down to the cave where the creature responsible for the poisoning can be found. Cast 'remove poison' \non roots until it dissapears. Once the roots are gone, enter the cave, kill the creature and butcher it. Take the evidence back to \nTreebeard who will reward you by sharing some ent-draught with you. You have a limited time to get the chelicera back to Treebeard \nafter triggering his quest. If in doubt, get the chelicera, then go to Treebeard and trigger the quest before giving it to him.",
    "reward": "+1 will (for 1 RL week), +entish.",
    "achievement": "You have aided Treebeard in cleansing Fangorn."
  },
  {
    "zone": "Fangorn",
    "quest_name": "An Ent and an axe",
    "target_player": "Whitie, BN",
    "repeatable": true,
    "location": "Fangorn, At a Fallen Tree (2n 2e from Leaflock).",
    "objective": "Free the axe buried deep in the Ent's back",
    "description": "While venturing in some of the darkest depths of the great forest Fangorn, I encountered an ent who had recently been injured. \nAfter carefully examining me and deeming me to be a person of merit, he confided in me that he was unable to remove the axe that \nwas stuck in his back by himself. He implored me to assist him.\n\nThe axe was buried deep in the ent's back. I had to free both of my hands in order to get a proper grip upon it. With great effort,\nI was able to wrench the offending object loose, whereupon the ent immediately seized it and snapped it in twain. He offered no \nreward other than his heartfelt thanks, but that was more than sufficient.",
    "walkthrough": "Find the beech tree with this axe in his back. It mutters about an axe in his back. When ent turns around and exposes his back, \nfree your both hands and 'remove axe tree'. After that he destroys the axe and will reward you with xp.",
    "reward": "2000 xp, +entish.",
    "achievement": "You helped an Ent by removing an orc axe from its back."
  },
  {
    "zone": "Fangorn",
    "quest_name": "Leafcake",
    "target_player": "Whitie, BN",
    "repeatable": false,
    "location": "Fangorn Forest, Woodland Hall",
    "objective": "",
    "description": "As I cleared that massive fungal growth that impeded my travel east, I became aware of the figure of what seemed to be a tree. \nUpon closer examination it was clear I was in the presence of an Ent who had gone almost tree-ish. I attempted to draw it out of \nits slumber by sharing stories about the orcs, burįrum as the Ents call them in their tongue.\n\nHe slowly awakened and thanked me for bringing him out of his slumber. He gazed at the diary I had with me and I decided to give \nit to him. He was very grateful and shared with me a recipe to make leaf-cakes, a concoction he said would help me cure some of \nthe pesky diseases that can be found affecting the people of Arda.",
    "walkthrough": "Locate the diary of a long dead traveler, it loads in an abandoned village 2s w 4s 2e from the entrance to the orkish mining camp. \nOnce you have the diary go to the sad looking tree in Fangorn, he loads near Treebeard (4e n 5e n 6e 2n e) east of the room with \n3 brown funguses. Kill the funguses to enter his room. Once you find the sad looking tree, 'say orc' a few times in westron, make \nsure you have the diary in your inventory. Give the diary to the tree.",
    "reward": "Leaf-cake herblore, +entish.",
    "achievement": "You have awakened a drowsy ent in Fangorn, and learned how to prepare a potion to cure the flu."
  },
  {
    "zone": "Fangorn",
    "quest_name": "A spider's fang",
    "target_player": "Darkie, not Zorc",
    "repeatable": true,
    "location": "Dol Guldur, Smoky Overhang; Eastern Fangorn",
    "objective": "Bring Gurgur a massive spider's chelicera from Fangorn",
    "description": "As I was wandering about in the Morgundul Encampment, Gurgur the Blight started talking to me about poisons. Maybe in amusement. \nHe talked about his preference for slowly killing our enemies. He spoke of the use of poison, especially those from the great \nspiders of old. He then told me about rumours of a lair far south in the forest of Fangorn. He said that, should I bring him back\nthe fangs of the beast he would provide me with a worthy weapon, if I paid him the right price.\n\nI found the chelicera of a great monstrous spider and brought it back to Gurgur who demanded 10 gold coins. I paid him the dues \nand was handed a spider's fang in return.",
    "walkthrough": "Gurgur from Morgudul Encampment in Dol Guldur ask you to bring him chelicera from spider in Fangorn. This quest is dark side version \nof 'A blight in Fangorn' quest. Cast 'remove poison' on roots until it dissapears, kill the spider and bring chelicera to Gurgur \nin Dol Guldur. When asked hand over 10 gold to recive spider's fang.",
    "reward": "Spider's fang (6 charges of l22 venom)",
    "achievement": "You delivered the chelicera of a monstrous black spider to Gurgur the Blight."
  },
  {
    "zone": "Fangorn",
    "quest_name": "The lost Entwives",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Fangorn Forest, Isenford, Weathertop, Shire",
    "objective": "Travel the lands and learn about the Entwives",
    "description": "While travelling the lands between Rohan and the fair forests of Lotholórien I crossed the mighty forest of Fangorn. Nearing the \nEntwash, I decided to take a short rest and, near a small river I met old Treebeard, after who the forest is named. Among the \nstories he shared with me, he talked about the entwives and mentioned that I should seek Leaflock nearby north of the Entwash.\n\nHarle and I then took the perilous journey from the Old Forest back to Fangorn and to Treebeard's lands. Treebeard could not hide \nhis joy at the news Harle and I brought to him and shared with us one of the fabled draughts from Fangorn, strange magicks certainly \ninfluence the waters of the Entwash!",
    "walkthrough": "Ask Treebeard 'entwives', then go to Leaflock and ask him about it too, repeat this for Rengold and the Dunadan ranger. Leaflock \nis 2w 2s from the darkened orkish axe tree: \"An enormous tree, overgrown with moss, is here.\" is his description. Rengold is just\nsoutheast from the Isenford, and the Dunadan ranger is the one behind the culvert, near Weathertop. You will finally find out that\nyou are looking for a hobbit named Harle. He can be found either in the Bywater Inn, in the Green Dragon, or in the Floating Log \nin Frogmorton. His description is: \"An aloof hobbit is here, babbling wide-eyed about his adventures.\" and his name will change \nfrom \"an aloof hobbit\" to Harle after you agree to lead him on his quest. Ask him 'entwives', he will talk, then ask if you're \nwilling to go with him. If you agree, he will follow you; bring him to Tom Bombadil, then once he's finished there, take him to \nTreebeard.\nIf you are doing this quest a second time you can skip the first part of the quest.\nHarle can ride. Find a a pony or a mule and say 'lead'. He will auto-lead and auto-ride afterwards.\nYou must complete each part of the quest and each part gives 250tps.",
    "reward": "",
    "achievement": "You have escorted Harle all the way from the Shire to the depths of Fangorn, to bring the evidence about the entwives to Treebeard."
  },
  {
    "zone": "Lórien",
    "quest_name": "Assisting Anarwen",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Vine-covered Arbour, north from Caras Galadhon.",
    "objective": "Release the tortured spirit below the Golden Wood",
    "description": "Whilst roaming the unparalleled splendour of Lothlórien, I noted that the normally flawless garden of Anarwen was fading. Worse, \na sinister mist seemed to be seeping from the very ground itself. As I searched further, I encountered Anarwen herself. Her eyes \npierced me to my inner core, but she must have been satisfied with what she found. She told me of an evil, tortured spirit that \nhad found its way into a cavern beneath the Golden Wood. She begged me to release it so that the forest can once again flourish.\n\nI descended far into the depths, where I found a large cavern. The tormented spirit was there, having taken the form of a cloud \nof mist. In its pain, it attacked me at once. I fought valiantly against it, despite an icy wind that struck at me again and again, \nthreatening to weaken my resolution and sap my strength. At long last, the cloud vanished and the spirit was released. Anarwen\nrewarded me with a few coins, along with some potent herbs carefully selected from her garden. The greatest reward, however, was \nseeing the forest thrive once more.",
    "walkthrough": "Find Anarwen the priestess resting northeast in the zone in the garden. Examine tree to see if the quest loads, if it says 'The \nmallorn-trees seem to be afflicted by some disease' then the quest loads, if it says, 'The twin mellyrn stand proudly on the sides\nof the entrance to the arbour' then no quest. It is also possible to examine 'flowers' to see if they are fading or not. She will \ntalk to you and if you agree some exit down opens. Kill the cloud of mist 2d and Anarwen will be happy.",
    "reward": "3 gold, ginseng root, 1-3 athelas leaves",
    "achievement": "You helped Anarwen to release the evil spirit that had crept under the roots of the Golden Wood."
  },
  {
    "zone": "Lórien",
    "quest_name": "Dagnir's spirit",
    "target_player": "Anyone",
    "repeatable": true,
    "location": "Lothlorien, 3n 1-2e from marshes",
    "objective": "Set Dagnir's spirit free by recovering a lost amulet",
    "description": "South of the shades of Lothlórien lie lands that were once home to many Elves and Men. Now rarely travelled, these lands harbour \nthe spirits of those that once fought the minions of the Dark Lord. It was one night, shortly after sunset that I met one such a \nspirit. Its gray form revealed the vise of a once noble man, a mighty warrior that once fought the evil creatures that prowled the \nlands. It seemed forlorn, with his thoughts lost in time. As he became aware of me he looked at me and asked to share his story.\nHe chuckled at my agreement and began his narrative.\n\nHe recalled a night of strife, of fire and sword when the Orcs ran in defeat from them. As they gave chase they entered a treacherous \nswamp. But a strange mist arose from the waters and provided the evil creatures with an unexpected hiding place. It was one of these \nOrcs that, taking advantage of the mists, stabbed him dead. Unfortunately his spirit was trapped in between worlds, his will bent \ntowards an amulet on his person, a gift from one of the Elves of the Golden Wood. Then he blurred slightly and continued to wander. \nI left south, seeking to bring peace to the soul of this once mighty warrior.\n\nAs I entered the swamp a mist appeared to be covering the ground. Then out of nowhere I was grabbed by something in the mist and \ndragged down, into the murky waters and through the mud. As I sank deeper I thought I neared my death. Then, suddenly, it was over, \nthe mud that surrounded me gave way and opened into a dark cavern. I had barely recovered my senses when I noticed, hiding in the\nshadows, dreadful mottled snakes and large subterranean lizards. After doing away with the nasty reptiles I searched the cavern. \nI found a skeleton, on it a rusty medallion that almost confirmed it belonged to Dagnir. I took the medallion and used the remains \nof the large lizards to reach the cavern roof and pushed myself through the muddy ceiling back to the surface of the swamp.\n\nIt was night when I finally ran into Dagnir's spirit again and returned the amulet to him. He looked at it with joyful yet sad eyes. \nThe words that followed made me realize what had transpired. This was a gift of love; it was a love not meant to be, for the ways of \nMen and Elves are separate on Arda. But the relief brought to Dagnir would finally allow him to depart Arda. As his shade slowly \nvanished, the medallion dropped to the floor. I picked it up only to have it crumble in my hands like a bunch of dry leaves leaving \nbehind a jade-encrusted key. Intrigued I searched the nearby area and found a hatch. Upon entering it I found myself in front of an \narch, closed by locked doors. The key fit the lock and I entered the chamber beyond. There, after a quick search, I found the small \ntreasure. No doubt left behind to assist those who would fight against the Dark Lord.",
    "walkthrough": "Dagnir's ghost is visible at night only. When you approach him, he starts talking. Nod when he asks if you want listen to him, and\nlisten. After he finishes, go to marshes and let the mud suck you into a small cave. There in the cave live 4 mottled snakes and \n2 subterranean lizards. In random room of caves lies a skeleton - loot it. To get out you need to kill both lizards and drag their \ncorpses to the central room - you can only climb up stepping on the lizard corpses (mottled corpses don't fit). Walk back to ghost \nand give him medallion from skeleton. Listen to him until his trapped soul goes free, then try to pick up the medallion. It will \ncrumble and reveal a jade-encrusted key. Go east, open hatch, down, unlock/open archeddoor, 2 south, open curtain, west and loot.",
    "reward": "8000 xp, double edged eket, amethyst, softly glowing green cup.",
    "achievement": "You freed the spirit of Dagnir the Man."
  },
  {
    "zone": "Lórien",
    "quest_name": "Ereniel's letter",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Eastern Lorien",
    "objective": "Find the key on the east side of Anduin for Ecthelion",
    "description": "While in Lothlórien, Ecthelion noticed an envelope I was carrying and asked to see it. He read the letter, written by Ereniel, \nand suggested that if I find the key mentioned in the letter, he might be able to provide more information. The letter mentioned \nthat the key was hidden in a secluded cave on the eastern side of Anduin.\n\nI found the key and returned with it to Ecthelion who then examined it. The leaf, though damaged, showcased the work of a great \ncraftsman, with intricate veins etched into its surface. Ecthelion restored its green shimmer and handed me the restored leaf. \n\"May you find it a tree to grow on, and may it bring you good fortune,\" he added.",
    "walkthrough": "You need to find the key and letter that load in two skeletons east of the Anduin. The letter loads in a skeleton inside a cave, \nguarded by a tentacled beast. You can find the cave from the exit \"mud\" (where lizards appear) by going 4n all e n d d. Kill the \nbeast and loot skeleton. The letter will hint you the name of the room where you find the next skeleton. Find room (it is not far \nfrom there) and open rockpile. Go down and kill first room of snakes. The rooms here seem unstable and I think casting earthquake \nspells might be a BAD idea. Open collapse and go east. You will find MORE snakes in an even more unstable room (exit back closes \non entrance so you need to re-open if you are going to try to flee). In addition there is muddled damage from falling debris. Kill \nrattlesnake and loot skeleton for key (leaf). Take letter and leaf to Echtelion, who will mend key. Now go to waterfall that is \nfound 6e s e from \"mud\" this will lead you to underground cavern. Secret door s in eastern room is wall. Put leaf wall, open and \nloot chest. You have to swim underwater to get out into the Anduin.",
    "reward": "2500+ xp, a small elven bag (endless water+lembas wafers and ropes, fishing rods and hunting knives)",
    "achievement": "You have acquired a fixed leaf-shaped key, made of shimmering metal. It must be important!"
  },
  {
    "zone": "Lórien",
    "quest_name": "Hithlain",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Lorien, Hythe on the Celebrant.",
    "objective": "Bring a hithlain plant to Cirel",
    "description": "I was wandering in the fair forests of Lothlórien I happened to meet a dedicated artisan. His long fingers carefully worked with \ndelicate yet strong threads weaving them into strong ropes. I asked about these threads, which are called hithlain in the tongue \nof the Silvan Elves. He told me they come from a plant of the same name, found in wet areas and grow surrounded by a natural fog. \nHe also told me that Cirel the Navigator, who makes the boats of the Galadhrim, was his major provider of such plants given that \nhe no longer travelled beyond the enchanted forests ruled by the Lord Celeborn. Moreover he hinted as to the fact that these rare \nplants do not grow west of the Misty Mountains.\n\nIn my travels through the lands east of the Misties I found, in some wetlands, a tall silvery plant surrounded by mist. I recalled \nthe description given to me by the Elven ropemaker from Lothlórien and immediately recognised it as hithlain. I promptly collected \nit and took it to Cirel the Navigator. He examined it carefully and reciprocated my gift with one of his own, a fine elven rope.",
    "walkthrough": "Ask the ropemaker about 'hithlain'. He will talk for a while, then direct you to Cirel the elven navigator (southeast of Caras \nGaladhon, north of the river). Find a misty plant, which loads in various locations by rivers in Lorien and the Anduin Vale, and \nbring it to Cirel. He will give you a fine elven rope; this rope can be retrieved from the bottom of slopes, but it may only work \nfor whomever has done the quest to obtain it. Giving the plant to Cirel also allows you to earn the fine elven rope, although \nsometimes he only gives 2 gold as a reward.",
    "reward": "Fine elven rope.",
    "achievement": "You found a misty hithlain plant and brought it to Cirel."
  },
  {
    "zone": "Lórien",
    "quest_name": "Ithildir's sorrow",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "A Cosy Flet, Western Lorien and OOC",
    "objective": "Search for lady Annariel on Ithildir's behalf",
    "description": "Ithildir is distraught; his mentor and friend, lady Annariel has gone missing in suspicious circumstances. I cannot bear to see him \nsuffer such sorrow and have agreed to go in search of her. The beryl ring he has given me will show Annariel that I am true of heart. \nI only hope that I can find her, and quickly.\n\nNever have I seen such joy! Annariel's rescue from her torment has restored Ithildir's hope. It may take many months before she \nis fully healed but Annariel will get the very best care from lady Galadriel. The reward that Ithildir gave me is nothing when \ncompared to the knowledge that I have saved a brave and noble lady from the torture she has had to endure.",
    "walkthrough": "Enter Ithildir's room 2n u from greenery in the west Lorien zone and he will start talking. When he asks you 'Are you seeking safety, \nadventure, or fighting our common foe?', say 'adventure'. He will continue talking and nod after he has asks you to help him. Then\nhe asks you to bring home Annariel Tingliwinde and gives you a beryl ring, so that she recognizes you as the rescuer. Annariel is \na captive in OOC, 2n from the orc prisoner. Kill the Sage and loot his key in order to unlock the door north. Adrahar the apprentice,\nwho guards there, flees when you enter. Give the beryl ring to Annariel and group her when she starts following you. Annariel will \nnot follow you if you decide to jump from OOC backway, you must walk her via Redhorn Pass to Ithildir. Take her out from the OOC \nand protect her. On the Redhorn Pass you are ambushed by Adrahar, 2 uruks and 2 orcs. A Morgundul uruk plants a solid kick in Annariel \nTingliwinde's rib-cage, and she collapses and falls to the ground. Kill them, on bad Adrahar flees and you can hunt him in Redhorn \nor skip. Cure Annariel after Adrahar dies or flees, you cannot do that when he is in the room. When you arrive at Ithildir, he \nrewards you with a silver morion.",
    "reward": "silver morion",
    "achievement": "You have rescued Annariel Tingliwinde from captivity."
  },
  {
    "zone": "Lórien",
    "quest_name": "Jeraton's blunt axe",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Village west of Lorien on the way to Fangorn",
    "objective": "Help the old woodcutter by giving him a new axe",
    "description": "Jeraton and his wife, Berel, are struggling to make a living in their village. Age has not been kind to him and he is struggling \nto find a replacement for his worn out axe. Normally he would walk to the civilised lands to the east to trade for a new one but \nhe is too frail to make such a long journey. If I was able to find a new axe for him I could help this family in their time of \nneed.\n\nI saved them! The new axe will let Jeraton earn enough to provide food for his family. In return, Jeraton gave me what was once \nhis prized possession, a stout oaken stick that will surely help me on longer journeys.",
    "walkthrough": "As you explore the village one of the women (Berel) will try to steal from you (and fail). She will then tell you of her problems \nand direct you to her husband (Jeraton). When you find him he will elaborate on this and ask for your assistance in getting a tool \nfor his work. Get him a woodsman axe and he will thank you and reward you.",
    "reward": "Stout oaken stick.",
    "achievement": "You obtained a new wood axe for woodcutter Jeraton, so that he can make a living."
  },
  {
    "zone": "Lórien",
    "quest_name": "Lazrria's demands",
    "target_player": "Darkie, not Zorc",
    "repeatable": true,
    "location": "The Orkish Commander's Hideout (east CA)",
    "objective": "Return with items from the enemy in the vicinity",
    "description": "Lazrria mentioned that her soldiers have been finding nearby objects of the elves. She demanded that I bring anything elvish in \nthe vicinity to her, or that she would cut off my ears.\n\nI returned to Lazrria with an item of the enemy that was found in the vicinity and she promptly burned it in the fireplace. \n \n<b>Walkthrough:</b>\nLazrria the Orkish Commander demans you to bring him anything elvish in the vicinity of her. Known items sofar are Elven letter, \nA dented, dull leaf of metal.",
    "walkthrough": "Lazrria the Orkish Commander demans you to bring him anything elvish in the vicinity of her. Known items sofar are Elven letter, \nA dented, dull leaf of metal.",
    "reward": "Elven letter - 887 xp in first time; A dented, dull leaf of metal - flask of orkish draught.",
    "achievement": "You gave X items from the enemy to Lazrria that were found in the vicinity."
  },
  {
    "zone": "Lórien",
    "quest_name": "Quenaire's tome",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Lorien, Tethel's Flet; Redhorn Pass; Rivendell, Hall of Fire",
    "objective": "Find a lost tome and bring it to Quenaire in Rivendell",
    "description": "I met a ranger named Tethel in a flet high above the ground, in the western outskirts of Lórien. She told a tale of an unfortunate \nElf who met with a gruesome fate in the Redhorn Pass. I agreed to look for a valuable tome that the Elf carried. Look in the snow \nat the base of a great crag in the pass, she told me; and if I should find the tome, to bring it to Quenairė in Rivendell.\n\nI managed to return the damaged tome to Quenairė. He truly appreciated it, although he was also anguished to hear of the terrible \nfate of the Elf who had originally borrowed the tome. He promised to recommend me to the Lady of Lothlórien, should I need such \nrecommendation! I am to ask Quenairė about a letter when and if I decide that I need one.",
    "walkthrough": "When you enter, Tethel may ask you if you are headed West. If she does and you agree with her, then she will tell you of an unfortunate \nelf who met a grisly end nearby. The dead elf was carrying a tome to Rivendell. You must seek it in the Redhorn Pass where it loads \nhidden. If you find the tome and take it to Quenaire in Rivendell, you will be rewarded and given a letter.",
    "reward": "letter for Tethel.",
    "achievement": "You have returned the lost tome to Quenaire."
  },
  {
    "zone": "Lórien",
    "quest_name": "White stag chase",
    "target_player": "Whitie",
    "repeatable": false,
    "location": "Lorien in the general area of Caras Galadhon.",
    "objective": "Chase the white stag through the woods",
    "description": "As I walked the paths of the Golden Wood, I saw a great white stag, unlike any other creature that walks the beautiful forests \nthat surround Caras Galadhon. He looked at me and jumped away quickly, vanishing into the trees and bushes.\n\nIntrigued I asked Curundil the Master Fletcher, whose knowledge of the forest and its inhabitants is second to none, about this\nmajestic stag. He confirmed that this stag is unusual and that it seems to want to lure hunters into a chase around the golden \nwoods. Moreover he shared the fact that it is a truly daunting task to keep pace with this beautiful animal. I decided to seek \nout the stag and see if I can match its speed and endurance in a chase around the woods!",
    "walkthrough": "Find the White Stag in the forest, and start chasing after him as he runs. After a (long) while of chasing him, he will thank you \nfor the chase, lead you to a reward, and disappear. Note that he moves via mudlle, so you cannot just 'follow' him. His movement \nis always one of two possibilities: First he will go one room in the direction it says he ran, then he will go either one extra \nroom in that same direction, or one room in either perpendicular direction. (For instance: If it says he vanishes in the forest \nto the east, you will either find him 2e, or e n, or e s.",
    "reward": "4000 xp, forest green cloak, large wooden wall shield, an amethyst, an elven shortbow.",
    "achievement": "You chased the white stag till the end of his run through the woods of Lorien."
  },
  {
    "zone": "Mirkwood",
    "quest_name": "Gnarled tribute",
    "target_player": "Anyone",
    "repeatable": true,
    "location": "East Mirkwood",
    "objective": "A gnarled old tree in Mirkwood demands tribute",
    "description": "While exploring the darkest depths of Mirkwood, I came upon what must be an ancient Ent. It is clearly mad, changed and corrupted \nby the dark powers that seep through the forest. It set me a task, though if it is wise to aid this creature in any way is doubtful.\n\nEither way what it said was: The sable heart of beasts that soar the heights; the slivers of bitterly cold winter nights, these \nshall be your tribute to me.\n\nI guess it expects me to bring it something.\n\nThe sable heart turned out to be the black heart of a fell beast, and for the bitterly cold sliver I brought the gnarled tree a \nshard of black ice. Seemingly satisfied with these gifts, the creature gave me a bowl of draught to quaff, which I did. In hindsight \nthat seems like a questionable decision, yet it had a marvelous effect on my agility. Hopefully it had no other so far unknown \nside-effects...",
    "walkthrough": "NB! Reward cannot be combined with growth and vigour effects!\nBefore starting the quest, obtain a black heart and a shard of black ice: do yourself or get from another player. Black heart loads \nfrom Frayed fell beast in CA or Scarred fell beast in Emyn-nu-Fuin, shard from a Cloud of black, icy shards. Go to East Mirkwood \nto area around Centre of the Twisted Woods and kill oaks and a darkly gnarled tree. Do not kill next gnarled tree because it's \nthe quest mob, who summons more oaks and vines. If you get hit by gnarled flee and do oaks and vines. Kill all mobs he summons \nand then give one by one items to a gnarled tree for rewarded. After quest is completed you can kill it if you want.",
    "reward": "+6 dodge (for a RL week).",
    "achievement": "You brought Oakscar the gnarled ent the objects he desired."
  },
  {
    "zone": "Mirkwood",
    "quest_name": "Guildmaster Rahku",
    "target_player": "Troll",
    "repeatable": true,
    "location": "Emyn-nu-Fuin",
    "objective": "persuade Rahku to teach the secrets of climbing",
    "description": "Deep in the forest Mirkwood, I met an old but agile looking troll who was rumoured to master the art of climbing. Recalling some \npainful experiences I'd had when attempting to climb, I decided that I want to learn it too. When I demanded that Rahku teach me, \nhe refused! What an oaf! Instead, he appeared to be focused only to his next meal. He did say he could teach me a little, if I \nbrought him the corpse of a great, known fighter to eat.\n\nI learned that Rahku can be very picky on what he accepts to eat. Nevertheless I managed to drag a corpse of a famous fighter to \nhim. Rahku devoured it, and was so satisfied about his meal that in return he agreed to teach me!",
    "walkthrough": "Go to Rahku and ask 'climb', if he says 'One day, Rahku may consider teaching you', it means quest is not active. If he says: \n'Bring me a delicious, fresh puke corpse… Good, red meat!', it means quest is active. Wait until he finishes talking, if he asks \n'Is it a deal?', agree Rahku. After that give him corpse. Corpse must be white warlord, who had to be on white warlord list before \nkilling him, but not after.",
    "reward": "Ability to practice 3 pracs of climb.",
    "achievement": "Rahku the Mountain Troll accepted to teach you how to climb like a spider!"
  },
  {
    "zone": "Mirkwood",
    "quest_name": "Sad troll mother",
    "target_player": "Troll",
    "repeatable": false,
    "location": "ne Dol Guldur, Sullen Cave",
    "objective": "avenge her sons at the hand of a nasty man",
    "description": "I met a sad troll mother in the dark forest of Dol Guldur who rambled incessantly about the deaths of her sons. She was fettered \nby a huge iron collar that was clamped down on her neck. She described how a nasty man used his hand to open the collar with a \nloud click. She asked me to bring her his hand so she could be free once more.\n\nThe sad troll mother was so happy when I brought her the nasty man's hand. She immediately used the bloody hand to remove the \ncollar from her neck before gobbling the hand down with a burp! She then warned me that she had eaten the chain that the collar \nwas once attached to (causing her to defecate for days) and then discarded the collar unceremoniously on the ground to celebrate \nher freedom.",
    "walkthrough": "A sad troll mother in the dark forest of Dol Guldur rambles incessantly about the deaths of her sons. She was fettered by a huge \niron collar that was clamped down on her neck. She asks to bring her Magus hand so she could be free once more. Magus lives in \nnearby tower. Kill and butcher him for hand, bring it back to the troll mother.",
    "reward": "huge iron collar.",
    "achievement": "You lent a hand to the sad troll mother."
  },
  {
    "zone": "The Misty Mountains",
    "quest_name": "Beorn's head",
    "target_player": "Torc/Morc",
    "repeatable": true,
    "location": "Goblin-town, The Great Hall",
    "objective": "Bring Beorn's head to the Great Goblin in Goblin-town",
    "description": "As I ventured through Goblin-town, the Great Goblin himself beckoned me closer. He spoke of the terrible bear-man, Beorn, who has \nbeen a relentless thorn in his side. The Great Goblin's voice was filled with venom as he detailed the many ways Beorn had thwarted \nhis plans and killed his minions. He then offered me a task: to hunt down this shape-shifter, slay him, and bring back his head \nas proof. In return, the Great Goblin promised me riches and the title of Hero of Goblin-town.\n\nWith the head of the bear-man in hand, I returned to Goblin-town and presented it to the Great Goblin. He crowed in triumph, placing\nthe head on a spike and proclaiming himself the Slayer of the Skin-Changer. His eyes gleamed with malice as he turned to me, sneering \nand bestowing upon me the title of 'Lucky to be Alive.'",
    "walkthrough": "Great Goblin will ask you to bring him the head of Beorn. Quest triggers only when artifacts load. Killing Beorn is not an easy \ntask, a group is needed. Slaying Beorn the first time will grant you achievement. After butchering corpse bring the head to Great \nGoblin. Artifacts will load on Great Goblin himself and he will give you only achievement. To get items, kill him.",
    "reward": "The Great Black Scimitar and Crown of bones.",
    "achievement": "You have slain Beorn, the mighty skin-changer!\nYou are lucky to be alive after helping the Great Goblin of Goblin-town."
  },
  {
    "zone": "The Misty Mountains",
    "quest_name": "Dragon smoke",
    "target_player": "Anyone",
    "repeatable": true,
    "location": "A Damp Cave, (east of Rivendell).",
    "objective": "pay for Eoghha's services and find the smoke's source",
    "description": "In a damp cave within the Ettenmoors, I chanced upon Eoghha the Hillman, who revealed tales of smoke billowing from the heart of \nthe Misty Mountains. The tracker made a captivating proposition: for a sum of 20 gold coins, he would act as my guide to find the \nformidable fire-breathing dragon.\n\nI paid the sum, and Eoghha told me that he awaited my arrival at my camp in the heart of the treacherous Misty Mountains. The camp \nwas just east of a spring, beyond the thundering falls. He said that if I didn't arrive within two moons, he would return home, \nsatisfied that he had fulfilled his duty.\n\nI followed Eoghha deep into the heart of the Misty Mountains and found the source of the smoke coming from the depths of a hidden\ncavern. A deep, thunderous *SNORT* reverberated ominously from within.",
    "walkthrough": "Go to Eoghha (4e 4n 4e 8n 12e from Rivendell moors) and say 'lead dragon'. Then follow his instructions and pay him 20 gold. Next \nmeet him at A Crude Camp (some w of slag), follow him there and he will lead you to entrance of Mithnaur the Dragon and open it.",
    "reward": "Mithnaur the Dragon entrance.",
    "achievement": "You paid Eoghha for his services to find smoke among the Misty Mountains."
  },
  {
    "zone": "The Misty Mountains",
    "quest_name": "Herbs for Thrakghash",
    "target_player": "Darkie, not Zorc",
    "repeatable": true,
    "location": "Goblin-town, Hall of the Arcane",
    "objective": "Bring herbs to Thrakghash for his research",
    "description": "In Goblin-town I met Thrakghash of the Mordor Flame, teacher of the Dark Arts of our Lord. He tasked me with finding a number of \nherbs to help with his research.\n\nI have brought him the flowers of an alpine poppy, the yellowish petals found on the foxtail plant, a handful of dried mauve petals, \nand a ginseng root.\n\nNow he said he will give me a reward if I bring him a book on herblores.",
    "walkthrough": "<b>Reward:</b>\nherbal kit upgrade.",
    "reward": "herbal kit upgrade.",
    "achievement": ""
  },
  {
    "zone": "The Misty Mountains",
    "quest_name": "Orkish draught",
    "target_player": "Torc/Morc",
    "repeatable": false,
    "location": "Goblin-town, Them Commissary",
    "objective": "Bring a shiny trinket to Gruksh to learn the recipe",
    "description": "I asked Gruksh how to mix orkish draughts and he very tersely said it'll cost me. I need to somehow find and bring him a nice jewel \nor shiny trinket in order to learn the secret recipe.\n\nI found and gave Gruksh what he wanted and he provided me with the secret recipe to mix the orkish draught. He told me to listen \ncarefully and I memorized the necessary ingredients.",
    "walkthrough": "Bring a gem (any gem except amethyst) to the Gruksh and he will teach you the herblore.",
    "reward": "Orc-draught herblore.",
    "achievement": "You have learnt to mix orkish draughts from Gruksh, in exchange for a shiny trinket."
  },
  {
    "zone": "The Misty Mountains",
    "quest_name": "Orkish loremaster",
    "target_player": "Torc/Morc",
    "repeatable": true,
    "location": "Goblin-town, Cavern",
    "objective": "Bring the corpse of a whitepuke hero to the loremaster",
    "description": "I was promised a great reward by the orkish loremaster if I would drag the corpse of a whitepuke's great hero to him. Seeing as \nhow corpses don't last very long, I would have to hurry if I wanted to receive this reward.\n\nI slew a great whitepuke hero and dragged his cold remains over to the orkish loremaster who rewarded me with a red-striped orkish \nbattle-horn. He told me to blow it in battle and that it would increase the bloodlust of my fellow orcs along with calling for \nhelp from our nearby animal friends.",
    "walkthrough": "Bring the corpse of a whitepuke hero to the loremaster and you will recive reward for it.",
    "reward": "Crude orkish horn.",
    "achievement": "You brought the cold remnants of a whiteskin to the orkish loremaster, and got a powerful horn as reward."
  },
  {
    "zone": "The Misty Mountains",
    "quest_name": "Scars and strife",
    "target_player": "Morruhk Orc",
    "repeatable": false,
    "location": "Goblin-town, Kennels of the Uruk-Morruhk",
    "objective": "Escape to Goblin-town from the Home of the Morruhk",
    "description": "It was in my home caves that I was roused from sleep to noise that didn't belong. Loud clashes of metal on metal echoed from a \nZaugurz raid as they slaughtered my tribe. I had to make my escape!\n\nI made it to the outdoors, finally free of the death trap that my home had become. I realised there is only one way to go: Goblin-\ntown to the east. I was convinced that the larger Tarkhnarb tribe were not in danger of being overrun by the stinking Zaugurz.\n\nGoblin-town was reached and a Tarkhnarb orc within told me to seek out Makrash in the warg kennels of the Great Hall.\n\nI found Makrash, Warg-trainer of the Morruhk. He explained that few of our tribe escaped to Goblin-town and that it was time for \nour tribe to lick our wounds and get our revenge on the Zaugurz.\n\nMakrash was proud of my feat, and rewarded me by grabbing my arm and etching a a pattern in my skin that would heal into the mighty\nscar of the soldier.",
    "walkthrough": "<b>Reward:</b>",
    "reward": "",
    "achievement": ""
  },
  {
    "zone": "The Misty Mountains",
    "quest_name": "Troll trouble",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "Prison Cell (2s 4w d e open stonetrap d from NOC crossing)",
    "objective": "Free the captured travellers of the High Pass",
    "description": "While exploring the eastern reaches of the Misty Mountains near the domains of the Great Goblin, I stumbled upon a troll hideout. \nIt appeared that these trolls had been ambushing travellers along the High Pass, and some unfortunate individuals were still held \ncaptive, presumably for sinister intentions.\n\nAs the last of the trolls fell, I found, on among the bodies, a key to the prison in which they held their captives. As I walked \nin, one of them, obviously a Gondorian of noble blood, bowed my way and I beckoned him to follow me to his freedom. As he acknowledged \nmy request, his companions stood up and followed him. I quickly led them out of the troll lair and upon being sure of their freedom, \nDuinhir of Blackroot Vale, for such was his name, thanked me and, before leaving to continue his journey, he gave me a small magical \nscroll, written on a piece of vellum.",
    "walkthrough": "First kill/bash/blind mountain troll on stonetrap, he guards exit down. Go down, west and kill 2 ologs. Loot green iron key from \nthe corpse of one of them, unlock/open prisondoor and go n. You can also pick/bash/break door. If there is noble prisoner (Duinhir \nof Blackroot Vale), beckon him. Lead him outside of prison, then he will give you vellum scroll as reward for saving his life.",
    "reward": "vellum scroll.",
    "achievement": "You rescued Duinhir of Blackroot Vale from captivity in a troll cave."
  },
  {
    "zone": "Rohan",
    "quest_name": "Broghha's fall",
    "target_player": "Whitie",
    "repeatable": true,
    "location": "The Eyot in the Isen",
    "objective": "Aid Haldin and the Rohir by defeating Broghha",
    "description": "While travelling near the River Isen, somewhat south of Isengard, I made a short stop at a fort of the Rohirrim. While resting I \nwas hailed by the leader of the garrison, one Haldin. He told me of a bandit chieftain, Broghha, who had been raiding their lands \nand made his abode in the lands west of the Isen, in a walled village compound by the name of Wulfston. He then proceeded to ask \nfor my assistance in dealing with this threat. He required me to bring back the spear of the Dunlending chieftain as proof of my \ndeed stating that I would be rewarded for it.\n\nI found Broggha and his cohorts in the village the locals call Wulfston. After a long and exhausting battle the leader of the bandits \nwas defeated. I claimed his weapon, a finely crafted spear with a steel-tip, as requested by Haldin. Upon seeing the weapon, Haldin \nrecalled its prior owner, a mighty warrior and, as he spoke a magnificent horse, such as those that are raised by the rohirrim, \nmade its way to us. Haldin mentioned that it was the horse of the a the mighty warrior warrior felled by Broggha and his minions \nand found it fitting that it remain with me, as a reminder of my service to the men and women of Rohan.",
    "walkthrough": "Haldin will start speaking, seemingly at random. He says that Broghha, who lives in Wulfston, west of the Isen, has been giving \nhim trouble. He asks that you kill him, and bring him Broghha's spear as proof of the deed. Kill Broghha, and bring Haldin the \nsteel-tipped spear.",
    "reward": "horse of the Rohirrim.",
    "achievement": "You brought Haldin the Marshal the spear of the Dunlending chieftain Broghha."
  }
]